; ModuleID = 'main'
source_filename = "main"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-musleabihf"

%runtime._string = type { ptr, i64 }
%"unicode/utf8.acceptRange" = type { i8, i8 }
%"internal/task.Task" = type { ptr, ptr, i64, %"sync/atomic.noCopy", %"internal/task.state", i8, i1, i8, ptr }
%"sync/atomic.noCopy" = type {}
%"internal/task.state" = type { i64, ptr, i64, i64, ptr, %"internal/task.Semaphore" }
%"internal/task.Semaphore" = type { %"internal/futex.Futex" }
%"internal/futex.Futex" = type { %"sync/atomic.Bool" }
%"sync/atomic.Bool" = type { %"sync/atomic.noCopy", i32 }
%runtime.elfHeader = type { i32, i8, i8, i8, i8, i8, [7 x i8], i16, i16, i32, i64, i64, i64, i32, i16, i16, i16, i16, i16, i16 }
%"internal/reflectlite.RawType" = type { i8 }
%"internal/reflectlite.ptrType" = type { %"internal/reflectlite.RawType", i16, ptr, %"internal/reflectlite.methodSet" }
%"internal/reflectlite.methodSet" = type { i64, [0 x ptr] }
%"internal/reflectlite.elemType" = type { %"internal/reflectlite.RawType", i16, ptr, ptr }
%"internal/reflectlite.arrayType" = type { %"internal/reflectlite.RawType", i16, ptr, ptr, i64, ptr }
%"internal/reflectlite.structType" = type { %"internal/reflectlite.RawType", i16, ptr, ptr, i32, i16, [1 x { ptr, ptr }] }
%"internal/reflectlite.rawStructField" = type { %runtime._string, %runtime._string, ptr, %runtime._string, i64, i1 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "stubs.go", directory: "/usr/local/go/src/math")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, align: 8, elements: !5)
!4 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!5 = !{!6}
!6 = !DISubrange(count: 15, lowerBound: 0)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!11 = !DIGlobalVariableExpression(var: !12, expr: !DIExpression())
!12 = distinct !DIGlobalVariable(scope: null, file: !13, line: 12, type: !14, isLocal: true, isDefinition: true)
!13 = !DIFile(filename: "itoa.go", directory: "/usr/local/lib/tinygo/src/internal/itoa")
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, align: 8, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 1, lowerBound: 0)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(scope: null, file: !13, line: 20, type: !14, isLocal: true, isDefinition: true)
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "unicode/utf8.first", linkageName: "unicode/utf8.first", scope: !21, file: !21, line: 71, type: !22, isLocal: false, isDefinition: true, align: 8)
!21 = !DIFile(filename: "utf8.go", directory: "/usr/local/lib/tinygo/src/unicode/utf8")
!22 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, align: 8, elements: !23)
!23 = !{!24}
!24 = !DISubrange(count: 256, lowerBound: 0)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "unicode/utf8.acceptRanges", linkageName: "unicode/utf8.acceptRanges", scope: !21, file: !21, line: 100, type: !27, isLocal: false, isDefinition: true, align: 8)
!27 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 256, align: 8, elements: !33)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "unicode/utf8.acceptRange", baseType: !29)
!29 = !DICompositeType(tag: DW_TAG_structure_type, size: 16, align: 8, elements: !30)
!30 = !{!31, !32}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "lo", baseType: !4, size: 8, align: 8)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "hi", baseType: !4, size: 8, align: 8, offset: 8)
!33 = !{!34}
!34 = !DISubrange(count: 16, lowerBound: 0)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(scope: null, file: !37, line: 393, type: !38, isLocal: true, isDefinition: true)
!37 = !DIFile(filename: "type.go", directory: "/usr/local/lib/tinygo/src/internal/reflectlite")
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, align: 8, elements: !39)
!39 = !{!40}
!40 = !DISubrange(count: 4, lowerBound: 0)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(name: "internal/reflectlite.errTypeElem", linkageName: "internal/reflectlite.errTypeElem", scope: !37, file: !37, line: 393, type: !43, isLocal: false, isDefinition: true, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64, dwarfAddressSpace: 0)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "internal/reflectlite.TypeError", baseType: !45)
!45 = !DICompositeType(tag: DW_TAG_structure_type, size: 128, align: 64, elements: !46)
!46 = !{!47}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "Method", baseType: !48, size: 128, align: 64)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", size: 128, align: 64, elements: !49)
!49 = !{!50, !52}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64, dwarfAddressSpace: 0)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "len", baseType: !53, size: 64, align: 64, offset: 64)
!53 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(scope: null, file: !37, line: 394, type: !56, isLocal: true, isDefinition: true)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, align: 8, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 3, lowerBound: 0)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "internal/reflectlite.errTypeKey", linkageName: "internal/reflectlite.errTypeKey", scope: !37, file: !37, line: 394, type: !43, isLocal: false, isDefinition: true, align: 64)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(scope: null, file: !37, line: 395, type: !63, isLocal: true, isDefinition: true)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, align: 8, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 5, lowerBound: 0)
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(name: "internal/reflectlite.errTypeField", linkageName: "internal/reflectlite.errTypeField", scope: !37, file: !37, line: 395, type: !43, isLocal: false, isDefinition: true, align: 64)
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(scope: null, file: !37, line: 397, type: !56, isLocal: true, isDefinition: true)
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(name: "internal/reflectlite.errTypeLen", linkageName: "internal/reflectlite.errTypeLen", scope: !37, file: !37, line: 397, type: !43, isLocal: false, isDefinition: true, align: 64)
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(scope: null, file: !37, line: 398, type: !74, isLocal: true, isDefinition: true)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, align: 8, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 8, lowerBound: 0)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "internal/reflectlite.errTypeNumField", linkageName: "internal/reflectlite.errTypeNumField", scope: !37, file: !37, line: 398, type: !43, isLocal: false, isDefinition: true, align: 64)
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(scope: null, file: !37, line: 399, type: !81, isLocal: true, isDefinition: true)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, align: 8, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 7, lowerBound: 0)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(name: "internal/reflectlite.errTypeChanDir", linkageName: "internal/reflectlite.errTypeChanDir", scope: !37, file: !37, line: 399, type: !43, isLocal: false, isDefinition: true, align: 64)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "type uint8", scope: !88, file: !88, line: 1, type: !89, isLocal: false, isDefinition: true, align: 64)
!88 = !DIFile(filename: "<Go type>", directory: "")
!89 = !DICompositeType(tag: DW_TAG_structure_type, size: 128, align: 64, elements: !90)
!90 = !{!91, !93}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "kind", baseType: !92, size: 8, align: 8)
!92 = !DIBasicType(name: "int8", size: 8, encoding: DW_ATE_signed)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "ptrTo", baseType: !94, size: 64, align: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe.Pointer", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(name: "type *uint8", scope: !88, file: !88, line: 1, type: !97, isLocal: false, isDefinition: true, align: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, size: 128, align: 64, elements: !98)
!98 = !{!91, !99, !101}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "numMethods", baseType: !100, size: 16, align: 16, offset: 16)
!100 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "elementType", baseType: !94, size: 64, align: 64, offset: 64)
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(name: "type struct{meta uint8}", scope: !88, file: !88, line: 1, type: !104, isLocal: false, isDefinition: true, align: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, size: 384, align: 64, elements: !105)
!105 = !{!91, !99, !93, !106, !107, !109, !110}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "pkgpath", baseType: !94, size: 64, align: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "size", baseType: !108, size: 32, align: 32, offset: 192)
!108 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "numFields", baseType: !100, size: 16, align: 16, offset: 224)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "fields", baseType: !111, size: 128, align: 64, offset: 256)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 128, align: 64, elements: !15)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "runtime.structField", baseType: !113)
!113 = !DICompositeType(tag: DW_TAG_structure_type, size: 128, align: 64, elements: !114)
!114 = !{!115, !116}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", baseType: !94, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "data", baseType: !51, size: 64, align: 64, offset: 64)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "type *struct{meta uint8}", scope: !88, file: !88, line: 1, type: !97, isLocal: false, isDefinition: true, align: 64)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(scope: null, file: !121, line: 17, type: !122, isLocal: true, isDefinition: true)
!121 = !DIFile(filename: "strconv.go", directory: "/usr/local/lib/tinygo/src/internal/reflectlite")
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, align: 8, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 14, lowerBound: 0)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(name: "type struct{}", scope: !88, file: !88, line: 1, type: !127, isLocal: false, isDefinition: true, align: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, size: 256, align: 64, elements: !128)
!128 = !{!91, !99, !93, !106, !107, !109, !129}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "fields", baseType: !130, align: 64, offset: 256)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, align: 64, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 0, lowerBound: 0)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "type *struct{}", scope: !88, file: !88, line: 1, type: !97, isLocal: false, isDefinition: true, align: 64)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(scope: null, file: !121, line: 250, type: !137, isLocal: true, isDefinition: true)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, align: 8, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 2, lowerBound: 0)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(scope: null, file: !121, line: 251, type: !3, isLocal: true, isDefinition: true)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(scope: null, file: !121, line: 252, type: !3, isLocal: true, isDefinition: true)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(scope: null, file: !121, line: 278, type: !137, isLocal: true, isDefinition: true)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(scope: null, file: !121, line: 280, type: !137, isLocal: true, isDefinition: true)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(scope: null, file: !121, line: 282, type: !137, isLocal: true, isDefinition: true)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(scope: null, file: !121, line: 284, type: !137, isLocal: true, isDefinition: true)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(scope: null, file: !121, line: 286, type: !137, isLocal: true, isDefinition: true)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(scope: null, file: !121, line: 288, type: !137, isLocal: true, isDefinition: true)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(scope: null, file: !121, line: 290, type: !137, isLocal: true, isDefinition: true)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(scope: null, file: !121, line: 294, type: !137, isLocal: true, isDefinition: true)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(scope: null, file: !121, line: 295, type: !3, isLocal: true, isDefinition: true)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(scope: null, file: !121, line: 296, type: !3, isLocal: true, isDefinition: true)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(scope: null, file: !121, line: 301, type: !137, isLocal: true, isDefinition: true)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(scope: null, file: !121, line: 303, type: !3, isLocal: true, isDefinition: true)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(scope: null, file: !121, line: 306, type: !137, isLocal: true, isDefinition: true)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(scope: null, file: !121, line: 308, type: !3, isLocal: true, isDefinition: true)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "type internal/reflectlite.ValueError", scope: !88, file: !88, line: 1, type: !174, isLocal: false, isDefinition: true, align: 64)
!174 = !DICompositeType(tag: DW_TAG_structure_type, size: 448, align: 64, elements: !175)
!175 = !{!91, !99, !93, !176, !177, !178}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "underlying", baseType: !94, size: 64, align: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "pkgpath", baseType: !94, size: 64, align: 64, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "name", baseType: !179, size: 184, align: 8, offset: 256)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 184, align: 8, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 23, lowerBound: 0)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(name: "type struct{Method string; Kind internal/reflectlite.Kind}", scope: !88, file: !88, line: 1, type: !184, isLocal: false, isDefinition: true, align: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, size: 512, align: 64, elements: !185)
!185 = !{!91, !99, !93, !106, !107, !109, !186}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "fields", baseType: !187, size: 256, align: 64, offset: 256)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 256, align: 64, elements: !138)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "type *struct{Method string; Kind internal/reflectlite.Kind}", scope: !88, file: !88, line: 1, type: !97, isLocal: false, isDefinition: true, align: 64)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(scope: null, file: !37, line: 60, type: !81, isLocal: true, isDefinition: true)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(scope: null, file: !37, line: 62, type: !38, isLocal: true, isDefinition: true)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(scope: null, file: !37, line: 64, type: !56, isLocal: true, isDefinition: true)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(scope: null, file: !37, line: 66, type: !38, isLocal: true, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(scope: null, file: !37, line: 68, type: !63, isLocal: true, isDefinition: true)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(scope: null, file: !37, line: 70, type: !63, isLocal: true, isDefinition: true)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(scope: null, file: !37, line: 72, type: !63, isLocal: true, isDefinition: true)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(scope: null, file: !37, line: 74, type: !38, isLocal: true, isDefinition: true)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(scope: null, file: !37, line: 76, type: !63, isLocal: true, isDefinition: true)
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(scope: null, file: !37, line: 78, type: !210, isLocal: true, isDefinition: true)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, align: 8, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: 6, lowerBound: 0)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(scope: null, file: !37, line: 80, type: !210, isLocal: true, isDefinition: true)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(scope: null, file: !37, line: 82, type: !210, isLocal: true, isDefinition: true)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(scope: null, file: !37, line: 84, type: !81, isLocal: true, isDefinition: true)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(scope: null, file: !37, line: 86, type: !81, isLocal: true, isDefinition: true)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(scope: null, file: !37, line: 88, type: !81, isLocal: true, isDefinition: true)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(scope: null, file: !37, line: 90, type: !225, isLocal: true, isDefinition: true)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, align: 8, elements: !226)
!226 = !{!227}
!227 = !DISubrange(count: 9, lowerBound: 0)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(scope: null, file: !37, line: 92, type: !230, isLocal: true, isDefinition: true)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, align: 8, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 10, lowerBound: 0)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(scope: null, file: !37, line: 94, type: !210, isLocal: true, isDefinition: true)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(scope: null, file: !37, line: 96, type: !122, isLocal: true, isDefinition: true)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(scope: null, file: !37, line: 98, type: !38, isLocal: true, isDefinition: true)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(scope: null, file: !37, line: 100, type: !225, isLocal: true, isDefinition: true)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(scope: null, file: !37, line: 102, type: !56, isLocal: true, isDefinition: true)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(scope: null, file: !37, line: 104, type: !63, isLocal: true, isDefinition: true)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(scope: null, file: !37, line: 106, type: !63, isLocal: true, isDefinition: true)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(scope: null, file: !37, line: 108, type: !38, isLocal: true, isDefinition: true)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(scope: null, file: !37, line: 110, type: !56, isLocal: true, isDefinition: true)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(scope: null, file: !37, line: 112, type: !210, isLocal: true, isDefinition: true)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(scope: null, file: !37, line: 114, type: !38, isLocal: true, isDefinition: true)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "type internal/reflectlite.TypeError", scope: !88, file: !88, line: 1, type: !257, isLocal: false, isDefinition: true, align: 64)
!257 = !DICompositeType(tag: DW_TAG_structure_type, size: 448, align: 64, elements: !258)
!258 = !{!91, !99, !93, !176, !177, !259}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "name", baseType: !260, size: 176, align: 8, offset: 256)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 176, align: 8, elements: !261)
!261 = !{!262}
!262 = !DISubrange(count: 22, lowerBound: 0)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "type struct{Method string}", scope: !88, file: !88, line: 1, type: !104, isLocal: false, isDefinition: true, align: 64)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "type *struct{Method string}", scope: !88, file: !88, line: 1, type: !97, isLocal: false, isDefinition: true, align: 64)
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(scope: null, file: !37, line: 329, type: !81, isLocal: true, isDefinition: true)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(scope: null, file: !37, line: 331, type: !81, isLocal: true, isDefinition: true)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(scope: null, file: !37, line: 338, type: !210, isLocal: true, isDefinition: true)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(scope: null, file: !37, line: 338, type: !14, isLocal: true, isDefinition: true)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(scope: null, file: !37, line: 340, type: !63, isLocal: true, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(scope: null, file: !37, line: 344, type: !14, isLocal: true, isDefinition: true)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(scope: null, file: !37, line: 346, type: !137, isLocal: true, isDefinition: true)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(scope: null, file: !37, line: 348, type: !14, isLocal: true, isDefinition: true)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(scope: null, file: !37, line: 348, type: !14, isLocal: true, isDefinition: true)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(scope: null, file: !37, line: 350, type: !38, isLocal: true, isDefinition: true)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(scope: null, file: !37, line: 350, type: !14, isLocal: true, isDefinition: true)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(scope: null, file: !37, line: 354, type: !225, isLocal: true, isDefinition: true)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(scope: null, file: !37, line: 359, type: !14, isLocal: true, isDefinition: true)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(scope: null, file: !37, line: 359, type: !14, isLocal: true, isDefinition: true)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(scope: null, file: !37, line: 361, type: !14, isLocal: true, isDefinition: true)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(scope: null, file: !37, line: 365, type: !14, isLocal: true, isDefinition: true)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(scope: null, file: !37, line: 368, type: !137, isLocal: true, isDefinition: true)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(scope: null, file: !37, line: 372, type: !303, isLocal: true, isDefinition: true)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, align: 8, elements: !304)
!304 = !{!305}
!305 = !DISubrange(count: 12, lowerBound: 0)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(scope: null, file: !37, line: 356, type: !74, isLocal: true, isDefinition: true)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(scope: null, file: !37, line: 1, type: !310, isLocal: true, isDefinition: true)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, align: 8, elements: !311)
!311 = !{!312}
!312 = !DISubrange(count: 33, lowerBound: 0)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(scope: null, file: !37, line: 1212, type: !315, isLocal: true, isDefinition: true)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, align: 8, elements: !316)
!316 = !{!317}
!317 = !DISubrange(count: 30, lowerBound: 0)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(scope: null, file: !37, line: 1212, type: !320, isLocal: true, isDefinition: true)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, align: 8, elements: !33)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(scope: null, file: !323, line: 1791, type: !324, isLocal: true, isDefinition: true)
!323 = !DIFile(filename: "value.go", directory: "/usr/local/lib/tinygo/src/internal/reflectlite")
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, align: 8, elements: !325)
!325 = !{!326}
!326 = !DISubrange(count: 17, lowerBound: 0)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(scope: null, file: !323, line: 1791, type: !122, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(scope: null, file: !323, line: 1793, type: !324, isLocal: true, isDefinition: true)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(scope: null, file: !323, line: 1793, type: !38, isLocal: true, isDefinition: true)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(scope: null, file: !323, line: 1793, type: !210, isLocal: true, isDefinition: true)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "internal/task.activeTasks", linkageName: "internal/task.activeTasks", scope: !337, file: !337, line: 45, type: !338, isLocal: false, isDefinition: true, align: 64)
!337 = !DIFile(filename: "task_threads.go", directory: "/usr/local/lib/tinygo/src/internal/task")
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64, dwarfAddressSpace: 0)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "internal/task.Task", baseType: !340)
!340 = !DICompositeType(tag: DW_TAG_structure_type, size: 704, align: 64, elements: !341)
!341 = !{!342, !343, !344, !346, !350, !376, !377, !379, !380}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "Next", baseType: !338, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "Ptr", baseType: !94, size: 64, align: 64, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "Data", baseType: !345, size: 64, align: 64, offset: 128)
!345 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "gcData", baseType: !347, align: 8, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "internal/task.gcData", baseType: !348)
!348 = !DICompositeType(tag: DW_TAG_structure_type, align: 8, elements: !349)
!349 = !{}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "state", baseType: !351, size: 384, align: 64, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "internal/task.state", baseType: !352)
!352 = !DICompositeType(tag: DW_TAG_structure_type, size: 384, align: 64, elements: !353)
!353 = !{!354, !355, !357, !358, !359, !360}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "id", baseType: !53, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "thread", baseType: !356, size: 64, align: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "internal/task.threadID", baseType: !94)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "stackTop", baseType: !53, size: 64, align: 64, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "stackBottom", baseType: !53, size: 64, align: 64, offset: 192)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "QueueNext", baseType: !338, size: 64, align: 64, offset: 256)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "pauseSem", baseType: !361, size: 32, align: 32, offset: 320)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "internal/task.Semaphore", baseType: !362)
!362 = !DICompositeType(tag: DW_TAG_structure_type, size: 32, align: 32, elements: !363)
!363 = !{!364}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "futex", baseType: !365, size: 32, align: 32)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "internal/task.Futex", baseType: !366)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "internal/futex.Futex", baseType: !367)
!367 = !DICompositeType(tag: DW_TAG_structure_type, size: 32, align: 32, elements: !368)
!368 = !{!369}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "Uint32", baseType: !370, size: 32, align: 32)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "sync/atomic.Uint32", baseType: !371)
!371 = !DICompositeType(tag: DW_TAG_structure_type, size: 32, align: 32, elements: !372)
!372 = !{!373, !375}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_", baseType: !374, align: 8)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "sync/atomic.noCopy", baseType: !348)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "v", baseType: !108, size: 32, align: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "FipsIndicator", baseType: !4, size: 8, align: 8, offset: 576)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "FipsOnlyBypass", baseType: !378, size: 8, align: 8, offset: 584)
!378 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "RunState", baseType: !4, size: 8, align: 8, offset: 592)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "DeferFrame", baseType: !94, size: 64, align: 64, offset: 640)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(name: "internal/task.mainTask", linkageName: "internal/task.mainTask", scope: !337, file: !337, line: 42, type: !339, isLocal: false, isDefinition: true, align: 64)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(scope: null, file: !385, line: 1, type: !315, isLocal: true, isDefinition: true)
!385 = !DIFile(filename: "mutex-preemptive.go", directory: "/usr/local/lib/tinygo/src/internal/task")
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "internal/task.numCPU", linkageName: "internal/task.numCPU", scope: !337, file: !337, line: 40, type: !388, isLocal: false, isDefinition: true, align: 32)
!388 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "internal/task.activeTaskLock", linkageName: "internal/task.activeTaskLock", scope: !337, file: !337, line: 46, type: !391, isLocal: false, isDefinition: true, align: 32)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "internal/task.PMutex", baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "internal/task.Mutex", baseType: !362)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(scope: null, file: !337, line: 64, type: !395, isLocal: true, isDefinition: true)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, align: 8, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 20, lowerBound: 0)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(scope: null, file: !337, line: 77, type: !303, isLocal: true, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "internal/task.otherGoroutines", linkageName: "internal/task.otherGoroutines", scope: !337, file: !337, line: 99, type: !108, isLocal: false, isDefinition: true, align: 32)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(scope: null, file: !337, line: 127, type: !225, isLocal: true, isDefinition: true)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(scope: null, file: !337, line: 146, type: !324, isLocal: true, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "internal/task.scanWaitGroup", linkageName: "internal/task.scanWaitGroup", scope: !337, file: !337, line: 151, type: !408, isLocal: false, isDefinition: true, align: 32)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "internal/task.waitGroup", baseType: !409)
!409 = !DICompositeType(tag: DW_TAG_structure_type, size: 32, align: 32, elements: !410)
!410 = !{!411}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "f", baseType: !365, size: 32, align: 32)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "internal/task.gcState", linkageName: "internal/task.gcState", scope: !337, file: !337, line: 180, type: !365, isLocal: false, isDefinition: true, align: 32)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "runtime.xorshift32State", linkageName: "runtime.xorshift32State", scope: !416, file: !416, line: 32, type: !108, isLocal: false, isDefinition: true, align: 32)
!416 = !DIFile(filename: "algorithm.go", directory: "/usr/local/lib/tinygo/src/runtime")
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "runtime.xorshift64State", linkageName: "runtime.xorshift64State", scope: !416, file: !416, line: 52, type: !345, isLocal: false, isDefinition: true, align: 64)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(name: "runtime.heapSize", linkageName: "runtime.heapSize", scope: !421, file: !421, line: 298, type: !53, isLocal: false, isDefinition: true, align: 64)
!421 = !DIFile(filename: "runtime_unix.go", directory: "/usr/local/lib/tinygo/src/runtime")
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(name: "type string", scope: !88, file: !88, line: 1, type: !89, isLocal: false, isDefinition: true, align: 64)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(name: "type *string", scope: !88, file: !88, line: 1, type: !97, isLocal: false, isDefinition: true, align: 64)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(name: "runtime.zeroSizedAlloc", linkageName: "runtime.zeroSizedAlloc", scope: !428, file: !428, line: 30, type: !4, isLocal: false, isDefinition: true, align: 8)
!428 = !DIFile(filename: "gc_boehm.go", directory: "/usr/local/lib/tinygo/src/runtime")
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "runtime.gcLock", linkageName: "runtime.gcLock", scope: !428, file: !428, line: 32, type: !391, isLocal: false, isDefinition: true, align: 32)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(scope: null, file: !428, line: 93, type: !324, isLocal: true, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(scope: null, file: !435, line: 78, type: !81, isLocal: true, isDefinition: true)
!435 = !DIFile(filename: "panic.go", directory: "/usr/local/lib/tinygo/src/runtime")
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(scope: null, file: !435, line: 99, type: !438, isLocal: true, isDefinition: true)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, align: 8, elements: !439)
!439 = !{!440}
!440 = !DISubrange(count: 24, lowerBound: 0)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(scope: null, file: !435, line: 101, type: !137, isLocal: true, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(scope: null, file: !435, line: 103, type: !445, isLocal: true, isDefinition: true)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, align: 8, elements: !261)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(scope: null, file: !435, line: 184, type: !448, isLocal: true, isDefinition: true)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, align: 8, elements: !180)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(scope: null, file: !435, line: 194, type: !451, isLocal: true, isDefinition: true)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, align: 8, elements: !452)
!452 = !{!453}
!453 = !DISubrange(count: 18, lowerBound: 0)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(scope: null, file: !435, line: 199, type: !451, isLocal: true, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(scope: null, file: !435, line: 212, type: !458, isLocal: true, isDefinition: true)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, align: 8, elements: !459)
!459 = !{!460}
!460 = !DISubrange(count: 37, lowerBound: 0)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !435, line: 222, type: !122, isLocal: true, isDefinition: true)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(scope: null, file: !465, line: 117, type: !56, isLocal: true, isDefinition: true)
!465 = !DIFile(filename: "print.go", directory: "/usr/local/lib/tinygo/src/runtime")
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !465, line: 120, type: !38, isLocal: true, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(scope: null, file: !465, line: 123, type: !38, isLocal: true, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !465, line: 197, type: !56, isLocal: true, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(scope: null, file: !465, line: 200, type: !38, isLocal: true, isDefinition: true)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(scope: null, file: !465, line: 203, type: !38, isLocal: true, isDefinition: true)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(scope: null, file: !465, line: 272, type: !137, isLocal: true, isDefinition: true)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(scope: null, file: !465, line: 279, type: !137, isLocal: true, isDefinition: true)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(scope: null, file: !465, line: 373, type: !56, isLocal: true, isDefinition: true)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(scope: null, file: !465, line: 391, type: !38, isLocal: true, isDefinition: true)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(scope: null, file: !465, line: 393, type: !63, isLocal: true, isDefinition: true)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(name: "runtime.stackTop", linkageName: "runtime.stackTop", scope: !421, file: !421, line: 75, type: !53, isLocal: false, isDefinition: true, align: 64)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(name: "runtime.main_argc", linkageName: "runtime.main_argc", scope: !421, file: !421, line: 105, type: !388, isLocal: false, isDefinition: true, align: 32)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "runtime.main_argv", linkageName: "runtime.main_argv", scope: !421, file: !421, line: 106, type: !492, isLocal: false, isDefinition: true, align: 64)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64, dwarfAddressSpace: 0)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(scope: null, file: !421, line: 155, type: !438, isLocal: true, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(scope: null, file: !421, line: 160, type: !320, isLocal: true, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(scope: null, file: !421, line: 163, type: !210, isLocal: true, isDefinition: true)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(scope: null, file: !421, line: 165, type: !210, isLocal: true, isDefinition: true)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(scope: null, file: !421, line: 167, type: !81, isLocal: true, isDefinition: true)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(scope: null, file: !421, line: 158, type: !395, isLocal: true, isDefinition: true)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(name: "runtime.signalFutex", linkageName: "runtime.signalFutex", scope: !421, file: !421, line: 354, type: !366, isLocal: false, isDefinition: true, align: 32)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "runtime.heapMaxSize", linkageName: "runtime.heapMaxSize", scope: !421, file: !421, line: 299, type: !53, isLocal: false, isDefinition: true, align: 64)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "runtime.heapStart", linkageName: "runtime.heapStart", scope: !421, file: !421, line: 301, type: !53, isLocal: false, isDefinition: true, align: 64)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(name: "runtime.heapEnd", linkageName: "runtime.heapEnd", scope: !421, file: !421, line: 301, type: !53, isLocal: false, isDefinition: true, align: 64)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(scope: null, file: !421, line: 317, type: !515, isLocal: true, isDefinition: true)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, align: 8, elements: !516)
!516 = !{!517}
!517 = !DISubrange(count: 27, lowerBound: 0)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "runtime.receivedSignals", linkageName: "runtime.receivedSignals", scope: !421, file: !421, line: 358, type: !370, isLocal: false, isDefinition: true, align: 32)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "runtime.printLock", linkageName: "runtime.printLock", scope: !522, file: !522, line: 136, type: !392, isLocal: false, isDefinition: true, align: 32)
!522 = !DIFile(filename: "scheduler_threads.go", directory: "/usr/local/lib/tinygo/src/runtime")
!523 = distinct !DICompileUnit(language: DW_LANG_C99, file: !524, producer: "TinyGo", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!524 = !DIFile(filename: "<unknown>", directory: "")
!525 = distinct !DICompileUnit(language: DW_LANG_C99, file: !524, producer: "TinyGo", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !526)
!526 = !{!527, !530, !579, !587, !602, !612, !618, !627, !653, !660, !666, !681, !683, !685, !687, !689, !691, !693, !695, !697, !699, !704, !706, !711, !713, !716, !718, !720, !722, !724, !726, !728, !730, !732, !734, !736, !738, !740, !742, !744, !746, !748, !750, !752, !754, !756, !758, !760, !762, !424, !422, !768}
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "internal/cpu.CacheLineSize", linkageName: "internal/cpu.CacheLineSize", scope: !529, file: !529, line: 17, type: !53, isLocal: false, isDefinition: true, align: 64)
!529 = !DIFile(filename: "cpu.go", directory: "/usr/local/go/src/internal/cpu")
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "internal/cpu.X86", linkageName: "internal/cpu.X86", scope: !529, file: !529, line: 23, type: !532, isLocal: false, isDefinition: true, align: 8)
!532 = !DICompositeType(tag: DW_TAG_structure_type, size: 1304, align: 8, elements: !533)
!533 = !{!534, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_", baseType: !535, size: 512, align: 8)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "internal/cpu.CacheLinePad", baseType: !536)
!536 = !DICompositeType(tag: DW_TAG_structure_type, size: 512, align: 8, elements: !537)
!537 = !{!538}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_", baseType: !539, size: 512, align: 8)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !540, size: 512, align: 8, elements: !541)
!540 = !DIBasicType(name: "byte", size: 8, encoding: DW_ATE_unsigned)
!541 = !{!542}
!542 = !DISubrange(count: 64, lowerBound: 0)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "HasAES", baseType: !378, size: 8, align: 8, offset: 512)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "HasADX", baseType: !378, size: 8, align: 8, offset: 520)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX", baseType: !378, size: 8, align: 8, offset: 528)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVXVNNI", baseType: !378, size: 8, align: 8, offset: 536)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX2", baseType: !378, size: 8, align: 8, offset: 544)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512", baseType: !378, size: 8, align: 8, offset: 552)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512F", baseType: !378, size: 8, align: 8, offset: 560)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512CD", baseType: !378, size: 8, align: 8, offset: 568)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512BW", baseType: !378, size: 8, align: 8, offset: 576)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512DQ", baseType: !378, size: 8, align: 8, offset: 584)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512VL", baseType: !378, size: 8, align: 8, offset: 592)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512GFNI", baseType: !378, size: 8, align: 8, offset: 600)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512VAES", baseType: !378, size: 8, align: 8, offset: 608)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512VNNI", baseType: !378, size: 8, align: 8, offset: 616)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512VBMI", baseType: !378, size: 8, align: 8, offset: 624)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512VBMI2", baseType: !378, size: 8, align: 8, offset: 632)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512BITALG", baseType: !378, size: 8, align: 8, offset: 640)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512VPOPCNTDQ", baseType: !378, size: 8, align: 8, offset: 648)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512VPCLMULQDQ", baseType: !378, size: 8, align: 8, offset: 656)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "HasBMI1", baseType: !378, size: 8, align: 8, offset: 664)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "HasBMI2", baseType: !378, size: 8, align: 8, offset: 672)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "HasERMS", baseType: !378, size: 8, align: 8, offset: 680)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "HasFSRM", baseType: !378, size: 8, align: 8, offset: 688)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "HasFMA", baseType: !378, size: 8, align: 8, offset: 696)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "HasGFNI", baseType: !378, size: 8, align: 8, offset: 704)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "HasOSXSAVE", baseType: !378, size: 8, align: 8, offset: 712)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "HasPCLMULQDQ", baseType: !378, size: 8, align: 8, offset: 720)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "HasPOPCNT", baseType: !378, size: 8, align: 8, offset: 728)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "HasRDTSCP", baseType: !378, size: 8, align: 8, offset: 736)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "HasSHA", baseType: !378, size: 8, align: 8, offset: 744)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "HasSSE3", baseType: !378, size: 8, align: 8, offset: 752)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "HasSSSE3", baseType: !378, size: 8, align: 8, offset: 760)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "HasSSE41", baseType: !378, size: 8, align: 8, offset: 768)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "HasSSE42", baseType: !378, size: 8, align: 8, offset: 776)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "HasVAES", baseType: !378, size: 8, align: 8, offset: 784)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_", baseType: !535, size: 512, align: 8, offset: 792)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "internal/cpu.ARM", linkageName: "internal/cpu.ARM", scope: !529, file: !529, line: 65, type: !581, isLocal: false, isDefinition: true, align: 8)
!581 = !DICompositeType(tag: DW_TAG_structure_type, size: 1048, align: 8, elements: !582)
!582 = !{!534, !583, !584, !585, !586}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "HasVFPv4", baseType: !378, size: 8, align: 8, offset: 512)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "HasIDIVA", baseType: !378, size: 8, align: 8, offset: 520)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "HasV7Atomics", baseType: !378, size: 8, align: 8, offset: 528)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_", baseType: !535, size: 512, align: 8, offset: 536)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(name: "internal/cpu.ARM64", linkageName: "internal/cpu.ARM64", scope: !529, file: !529, line: 75, type: !589, isLocal: false, isDefinition: true, align: 8)
!589 = !DICompositeType(tag: DW_TAG_structure_type, size: 1112, align: 8, elements: !590)
!590 = !{!534, !543, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "HasPMULL", baseType: !378, size: 8, align: 8, offset: 520)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "HasSHA1", baseType: !378, size: 8, align: 8, offset: 528)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "HasSHA2", baseType: !378, size: 8, align: 8, offset: 536)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "HasSHA512", baseType: !378, size: 8, align: 8, offset: 544)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "HasSHA3", baseType: !378, size: 8, align: 8, offset: 552)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "HasCRC32", baseType: !378, size: 8, align: 8, offset: 560)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "HasATOMICS", baseType: !378, size: 8, align: 8, offset: 568)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "HasCPUID", baseType: !378, size: 8, align: 8, offset: 576)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "HasDIT", baseType: !378, size: 8, align: 8, offset: 584)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "IsNeoverse", baseType: !378, size: 8, align: 8, offset: 592)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_", baseType: !535, size: 512, align: 8, offset: 600)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(name: "internal/cpu.Loong64", linkageName: "internal/cpu.Loong64", scope: !529, file: !529, line: 93, type: !604, isLocal: false, isDefinition: true, align: 8)
!604 = !DICompositeType(tag: DW_TAG_structure_type, size: 1064, align: 8, elements: !605)
!605 = !{!534, !606, !607, !608, !609, !610, !611}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "HasLSX", baseType: !378, size: 8, align: 8, offset: 512)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "HasLASX", baseType: !378, size: 8, align: 8, offset: 520)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "HasCRC32", baseType: !378, size: 8, align: 8, offset: 528)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "HasLAMCAS", baseType: !378, size: 8, align: 8, offset: 536)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "HasLAM_BH", baseType: !378, size: 8, align: 8, offset: 544)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_", baseType: !535, size: 512, align: 8, offset: 552)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(name: "internal/cpu.MIPS64X", linkageName: "internal/cpu.MIPS64X", scope: !529, file: !529, line: 103, type: !614, isLocal: false, isDefinition: true, align: 8)
!614 = !DICompositeType(tag: DW_TAG_structure_type, size: 1032, align: 8, elements: !615)
!615 = !{!534, !616, !617}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "HasMSA", baseType: !378, size: 8, align: 8, offset: 512)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_", baseType: !535, size: 512, align: 8, offset: 520)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(name: "internal/cpu.PPC64", linkageName: "internal/cpu.PPC64", scope: !529, file: !529, line: 114, type: !620, isLocal: false, isDefinition: true, align: 8)
!620 = !DICompositeType(tag: DW_TAG_structure_type, size: 1064, align: 8, elements: !621)
!621 = !{!534, !622, !623, !624, !625, !626, !611}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "HasDARN", baseType: !378, size: 8, align: 8, offset: 512)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "HasSCV", baseType: !378, size: 8, align: 8, offset: 520)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "IsPOWER8", baseType: !378, size: 8, align: 8, offset: 528)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "IsPOWER9", baseType: !378, size: 8, align: 8, offset: 536)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "IsPOWER10", baseType: !378, size: 8, align: 8, offset: 544)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(name: "internal/cpu.S390X", linkageName: "internal/cpu.S390X", scope: !529, file: !529, line: 124, type: !629, isLocal: false, isDefinition: true, align: 8)
!629 = !DICompositeType(tag: DW_TAG_structure_type, size: 1192, align: 8, elements: !630)
!630 = !{!534, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "HasZARCH", baseType: !378, size: 8, align: 8, offset: 512)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "HasSTFLE", baseType: !378, size: 8, align: 8, offset: 520)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "HasLDISP", baseType: !378, size: 8, align: 8, offset: 528)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "HasEIMM", baseType: !378, size: 8, align: 8, offset: 536)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "HasDFP", baseType: !378, size: 8, align: 8, offset: 544)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "HasETF3EH", baseType: !378, size: 8, align: 8, offset: 552)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "HasMSA", baseType: !378, size: 8, align: 8, offset: 560)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "HasAES", baseType: !378, size: 8, align: 8, offset: 568)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "HasAESCBC", baseType: !378, size: 8, align: 8, offset: 576)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "HasAESCTR", baseType: !378, size: 8, align: 8, offset: 584)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "HasAESGCM", baseType: !378, size: 8, align: 8, offset: 592)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "HasGHASH", baseType: !378, size: 8, align: 8, offset: 600)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "HasSHA1", baseType: !378, size: 8, align: 8, offset: 608)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "HasSHA256", baseType: !378, size: 8, align: 8, offset: 616)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "HasSHA512", baseType: !378, size: 8, align: 8, offset: 624)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "HasSHA3", baseType: !378, size: 8, align: 8, offset: 632)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "HasVX", baseType: !378, size: 8, align: 8, offset: 640)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "HasVXE", baseType: !378, size: 8, align: 8, offset: 648)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "HasKDSA", baseType: !378, size: 8, align: 8, offset: 656)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "HasECDSA", baseType: !378, size: 8, align: 8, offset: 664)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "HasEDDSA", baseType: !378, size: 8, align: 8, offset: 672)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_", baseType: !535, size: 512, align: 8, offset: 680)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(name: "internal/cpu.RISCV64", linkageName: "internal/cpu.RISCV64", scope: !529, file: !529, line: 154, type: !655, isLocal: false, isDefinition: true, align: 8)
!655 = !DICompositeType(tag: DW_TAG_structure_type, size: 1048, align: 8, elements: !656)
!656 = !{!534, !657, !658, !659, !586}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "HasFastMisaligned", baseType: !378, size: 8, align: 8, offset: 512)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "HasV", baseType: !378, size: 8, align: 8, offset: 520)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "HasZbb", baseType: !378, size: 8, align: 8, offset: 528)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(name: "internal/cpu.doDerived", linkageName: "internal/cpu.doDerived", scope: !529, file: !529, line: 174, type: !662, isLocal: false, isDefinition: true, align: 64)
!662 = !DICompositeType(tag: DW_TAG_structure_type, size: 128, align: 64, elements: !663)
!663 = !{!664, !665}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "context", baseType: !94, size: 64, align: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "fn", baseType: !94, size: 64, align: 64, offset: 64)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(name: "internal/cpu.options", linkageName: "internal/cpu.options", scope: !529, file: !529, line: 192, type: !668, isLocal: false, isDefinition: true, align: 64)
!668 = !DICompositeType(tag: DW_TAG_structure_type, name: "[]internal/cpu.option", size: 192, align: 64, elements: !669)
!669 = !{!670, !52, !680}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", baseType: !671, size: 64, align: 64)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64, align: 64, dwarfAddressSpace: 0)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "internal/cpu.option", baseType: !673)
!673 = !DICompositeType(tag: DW_TAG_structure_type, size: 256, align: 64, elements: !674)
!674 = !{!675, !676, !678, !679}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "Name", baseType: !48, size: 128, align: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "Feature", baseType: !677, size: 64, align: 64, offset: 128)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64, dwarfAddressSpace: 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "Specified", baseType: !378, size: 8, align: 8, offset: 192)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "Enable", baseType: !378, size: 8, align: 8, offset: 200)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "cap", baseType: !53, size: 64, align: 64, offset: 128)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(scope: null, file: !529, line: 218, type: !38, isLocal: true, isDefinition: true)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(scope: null, file: !529, line: 223, type: !310, isLocal: true, isDefinition: true)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(scope: null, file: !529, line: 223, type: !137, isLocal: true, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(scope: null, file: !529, line: 230, type: !137, isLocal: true, isDefinition: true)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(scope: null, file: !529, line: 239, type: !56, isLocal: true, isDefinition: true)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(scope: null, file: !529, line: 255, type: !315, isLocal: true, isDefinition: true)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(scope: null, file: !529, line: 255, type: !137, isLocal: true, isDefinition: true)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(scope: null, file: !529, line: 232, type: !56, isLocal: true, isDefinition: true)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(scope: null, file: !529, line: 235, type: !320, isLocal: true, isDefinition: true)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(scope: null, file: !529, line: 235, type: !701, isLocal: true, isDefinition: true)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, align: 8, elements: !702)
!702 = !{!703}
!703 = !DISubrange(count: 32, lowerBound: 0)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(scope: null, file: !529, line: 235, type: !137, isLocal: true, isDefinition: true)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(scope: null, file: !529, line: 264, type: !708, isLocal: true, isDefinition: true)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, align: 8, elements: !709)
!709 = !{!710}
!710 = !DISubrange(count: 25, lowerBound: 0)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(scope: null, file: !529, line: 264, type: !448, isLocal: true, isDefinition: true)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(name: "internal/cpu.maxExtendedFunctionInformation", linkageName: "internal/cpu.maxExtendedFunctionInformation", scope: !715, file: !715, line: 69, type: !108, isLocal: false, isDefinition: true, align: 32)
!715 = !DIFile(filename: "cpu_x86.go", directory: "/usr/local/go/src/internal/cpu")
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(scope: null, file: !715, line: 73, type: !56, isLocal: true, isDefinition: true)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(scope: null, file: !715, line: 74, type: !56, isLocal: true, isDefinition: true)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(scope: null, file: !715, line: 75, type: !38, isLocal: true, isDefinition: true)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(scope: null, file: !715, line: 76, type: !38, isLocal: true, isDefinition: true)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(scope: null, file: !715, line: 77, type: !225, isLocal: true, isDefinition: true)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(scope: null, file: !715, line: 78, type: !210, isLocal: true, isDefinition: true)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(scope: null, file: !715, line: 79, type: !56, isLocal: true, isDefinition: true)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(scope: null, file: !715, line: 80, type: !230, isLocal: true, isDefinition: true)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(scope: null, file: !715, line: 87, type: !210, isLocal: true, isDefinition: true)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(scope: null, file: !715, line: 88, type: !38, isLocal: true, isDefinition: true)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(scope: null, file: !715, line: 89, type: !63, isLocal: true, isDefinition: true)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(scope: null, file: !715, line: 90, type: !63, isLocal: true, isDefinition: true)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(scope: null, file: !715, line: 91, type: !63, isLocal: true, isDefinition: true)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(scope: null, file: !715, line: 97, type: !56, isLocal: true, isDefinition: true)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(scope: null, file: !715, line: 98, type: !38, isLocal: true, isDefinition: true)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(scope: null, file: !715, line: 99, type: !38, isLocal: true, isDefinition: true)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(scope: null, file: !715, line: 100, type: !38, isLocal: true, isDefinition: true)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(scope: null, file: !715, line: 101, type: !56, isLocal: true, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(scope: null, file: !715, line: 107, type: !81, isLocal: true, isDefinition: true)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(scope: null, file: !715, line: 108, type: !74, isLocal: true, isDefinition: true)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(scope: null, file: !715, line: 109, type: !74, isLocal: true, isDefinition: true)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(scope: null, file: !715, line: 110, type: !74, isLocal: true, isDefinition: true)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(scope: null, file: !715, line: 111, type: !74, isLocal: true, isDefinition: true)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(scope: null, file: !764, line: 1, type: !765, isLocal: true, isDefinition: true)
!764 = !DIFile(filename: "datacache_x86.go", directory: "/usr/local/go/src/internal/cpu")
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, align: 8, elements: !766)
!766 = !{!767}
!767 = !DISubrange(count: 13, lowerBound: 0)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(scope: null, file: !764, line: 1, type: !770, isLocal: true, isDefinition: true)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 664, align: 8, elements: !771)
!771 = !{!772}
!772 = !DISubrange(count: 83, lowerBound: 0)
!773 = distinct !DICompileUnit(language: DW_LANG_C99, file: !524, producer: "TinyGo", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !774)
!774 = !{!775, !779, !781, !789}
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(name: "math/bits.deBruijn32tab", linkageName: "math/bits.deBruijn32tab", scope: !777, file: !777, line: 44, type: !778, isLocal: false, isDefinition: true, align: 8)
!777 = !DIFile(filename: "bits.go", directory: "/usr/local/go/src/math/bits")
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !540, size: 256, align: 8, elements: !702)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(name: "math/bits.deBruijn64tab", linkageName: "math/bits.deBruijn64tab", scope: !777, file: !777, line: 51, type: !539, isLocal: false, isDefinition: true, align: 8)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(name: "math/bits.overflowError", linkageName: "runtime.overflowError", scope: !783, file: !783, line: 12, type: !784, isLocal: false, isDefinition: true, align: 64)
!783 = !DIFile(filename: "bits_errors.go", directory: "/usr/local/go/src/math/bits")
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "error", baseType: !785)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "runtime._interface", baseType: !786)
!786 = !DICompositeType(tag: DW_TAG_structure_type, size: 128, align: 64, elements: !787)
!787 = !{!115, !788}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "value", baseType: !94, size: 64, align: 64, offset: 64)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(name: "math/bits.divideError", linkageName: "runtime.divideError", scope: !783, file: !783, line: 15, type: !784, isLocal: false, isDefinition: true, align: 64)
!791 = distinct !DICompileUnit(language: DW_LANG_C99, file: !524, producer: "TinyGo", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !792)
!792 = !{!793, !795, !798, !803, !806, !809, !813, !815, !817, !819, !821, !823, !825, !827, !829, !831, !833, !835, !837, !839, !841, !843, !846, !848, !850, !852, !854, !856, !858, !860, !862, !864, !866, !868, !870, !872, !874, !876, !880, !882, !884, !887, !889, !891, !893, !897, !900, !905, !908, !910, !914, !916, !919, !921, !925, !928, !930, !932, !934, !936, !938, !940, !942, !944, !946, !948, !950, !952, !954, !956, !0, !7, !958, !960, !962, !964, !9, !966, !968, !970, !972, !974}
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(name: "internal/cpu.X86", linkageName: "internal/cpu.X86", scope: !529, file: !529, line: 23, type: !532, isLocal: false, isDefinition: true, align: 8)
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(name: "math.useFMA", linkageName: "math.useFMA", scope: !797, file: !797, line: 11, type: !378, isLocal: false, isDefinition: true, align: 8)
!797 = !DIFile(filename: "exp_amd64.go", directory: "/usr/local/go/src/math")
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(name: "math._gamP", linkageName: "math._gamP", scope: !800, file: !800, line: 66, type: !801, isLocal: false, isDefinition: true, align: 64)
!800 = !DIFile(filename: "gamma.go", directory: "/usr/local/go/src/math")
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !802, size: 448, align: 64, elements: !82)
!802 = !DIBasicType(name: "float64", size: 64, encoding: DW_ATE_float)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(name: "math._gamQ", linkageName: "math._gamQ", scope: !800, file: !800, line: 75, type: !805, isLocal: false, isDefinition: true, align: 64)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !802, size: 512, align: 64, elements: !75)
!806 = !DIGlobalVariableExpression(var: !807, expr: !DIExpression())
!807 = distinct !DIGlobalVariable(name: "math._gamS", linkageName: "math._gamS", scope: !800, file: !800, line: 85, type: !808, isLocal: false, isDefinition: true, align: 64)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !802, size: 320, align: 64, elements: !64)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(name: "math.p0R8", linkageName: "math.p0R8", scope: !811, file: !811, line: 240, type: !812, isLocal: false, isDefinition: true, align: 64)
!811 = !DIFile(filename: "j0.go", directory: "/usr/local/go/src/math")
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !802, size: 384, align: 64, elements: !211)
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(name: "math.p0S8", linkageName: "math.p0S8", scope: !811, file: !811, line: 248, type: !808, isLocal: false, isDefinition: true, align: 64)
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(name: "math.p0R5", linkageName: "math.p0R5", scope: !811, file: !811, line: 257, type: !812, isLocal: false, isDefinition: true, align: 64)
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(name: "math.p0S5", linkageName: "math.p0S5", scope: !811, file: !811, line: 265, type: !808, isLocal: false, isDefinition: true, align: 64)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(name: "math.p0R3", linkageName: "math.p0R3", scope: !811, file: !811, line: 274, type: !812, isLocal: false, isDefinition: true, align: 64)
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(name: "math.p0S3", linkageName: "math.p0S3", scope: !811, file: !811, line: 282, type: !808, isLocal: false, isDefinition: true, align: 64)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(name: "math.p0R2", linkageName: "math.p0R2", scope: !811, file: !811, line: 291, type: !812, isLocal: false, isDefinition: true, align: 64)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(name: "math.p0S2", linkageName: "math.p0S2", scope: !811, file: !811, line: 299, type: !808, isLocal: false, isDefinition: true, align: 64)
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(name: "math.q0R8", linkageName: "math.q0R8", scope: !811, file: !811, line: 339, type: !812, isLocal: false, isDefinition: true, align: 64)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(name: "math.q0S8", linkageName: "math.q0S8", scope: !811, file: !811, line: 347, type: !812, isLocal: false, isDefinition: true, align: 64)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(name: "math.q0R5", linkageName: "math.q0R5", scope: !811, file: !811, line: 357, type: !812, isLocal: false, isDefinition: true, align: 64)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(name: "math.q0S5", linkageName: "math.q0S5", scope: !811, file: !811, line: 365, type: !812, isLocal: false, isDefinition: true, align: 64)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(name: "math.q0R3", linkageName: "math.q0R3", scope: !811, file: !811, line: 375, type: !812, isLocal: false, isDefinition: true, align: 64)
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(name: "math.q0S3", linkageName: "math.q0S3", scope: !811, file: !811, line: 383, type: !812, isLocal: false, isDefinition: true, align: 64)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(name: "math.q0R2", linkageName: "math.q0R2", scope: !811, file: !811, line: 393, type: !812, isLocal: false, isDefinition: true, align: 64)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(name: "math.q0S2", linkageName: "math.q0S2", scope: !811, file: !811, line: 401, type: !812, isLocal: false, isDefinition: true, align: 64)
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(name: "math.p1R8", linkageName: "math.p1R8", scope: !845, file: !845, line: 235, type: !812, isLocal: false, isDefinition: true, align: 64)
!845 = !DIFile(filename: "j1.go", directory: "/usr/local/go/src/math")
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(name: "math.p1S8", linkageName: "math.p1S8", scope: !845, file: !845, line: 243, type: !808, isLocal: false, isDefinition: true, align: 64)
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(name: "math.p1R5", linkageName: "math.p1R5", scope: !845, file: !845, line: 252, type: !812, isLocal: false, isDefinition: true, align: 64)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(name: "math.p1S5", linkageName: "math.p1S5", scope: !845, file: !845, line: 260, type: !808, isLocal: false, isDefinition: true, align: 64)
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(name: "math.p1R3", linkageName: "math.p1R3", scope: !845, file: !845, line: 269, type: !812, isLocal: false, isDefinition: true, align: 64)
!854 = !DIGlobalVariableExpression(var: !855, expr: !DIExpression())
!855 = distinct !DIGlobalVariable(name: "math.p1S3", linkageName: "math.p1S3", scope: !845, file: !845, line: 277, type: !808, isLocal: false, isDefinition: true, align: 64)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(name: "math.p1R2", linkageName: "math.p1R2", scope: !845, file: !845, line: 286, type: !812, isLocal: false, isDefinition: true, align: 64)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(name: "math.p1S2", linkageName: "math.p1S2", scope: !845, file: !845, line: 294, type: !808, isLocal: false, isDefinition: true, align: 64)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(name: "math.q1R8", linkageName: "math.q1R8", scope: !845, file: !845, line: 334, type: !812, isLocal: false, isDefinition: true, align: 64)
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(name: "math.q1S8", linkageName: "math.q1S8", scope: !845, file: !845, line: 342, type: !812, isLocal: false, isDefinition: true, align: 64)
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(name: "math.q1R5", linkageName: "math.q1R5", scope: !845, file: !845, line: 352, type: !812, isLocal: false, isDefinition: true, align: 64)
!866 = !DIGlobalVariableExpression(var: !867, expr: !DIExpression())
!867 = distinct !DIGlobalVariable(name: "math.q1S5", linkageName: "math.q1S5", scope: !845, file: !845, line: 360, type: !812, isLocal: false, isDefinition: true, align: 64)
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(name: "math.q1R3", linkageName: "math.q1R3", scope: !845, file: !845, line: 370, type: !812, isLocal: false, isDefinition: true, align: 64)
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(name: "math.q1S3", linkageName: "math.q1S3", scope: !845, file: !845, line: 378, type: !812, isLocal: false, isDefinition: true, align: 64)
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(name: "math.q1R2", linkageName: "math.q1R2", scope: !845, file: !845, line: 388, type: !812, isLocal: false, isDefinition: true, align: 64)
!874 = !DIGlobalVariableExpression(var: !875, expr: !DIExpression())
!875 = distinct !DIGlobalVariable(name: "math.q1S2", linkageName: "math.q1S2", scope: !845, file: !845, line: 396, type: !812, isLocal: false, isDefinition: true, align: 64)
!876 = !DIGlobalVariableExpression(var: !877, expr: !DIExpression())
!877 = distinct !DIGlobalVariable(name: "math._lgamA", linkageName: "math._lgamA", scope: !878, file: !878, line: 91, type: !879, isLocal: false, isDefinition: true, align: 64)
!878 = !DIFile(filename: "lgamma.go", directory: "/usr/local/go/src/math")
!879 = !DICompositeType(tag: DW_TAG_array_type, baseType: !802, size: 768, align: 64, elements: !304)
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(name: "math._lgamR", linkageName: "math._lgamR", scope: !878, file: !878, line: 105, type: !801, isLocal: false, isDefinition: true, align: 64)
!882 = !DIGlobalVariableExpression(var: !883, expr: !DIExpression())
!883 = distinct !DIGlobalVariable(name: "math._lgamS", linkageName: "math._lgamS", scope: !878, file: !878, line: 114, type: !801, isLocal: false, isDefinition: true, align: 64)
!884 = !DIGlobalVariableExpression(var: !885, expr: !DIExpression())
!885 = distinct !DIGlobalVariable(name: "math._lgamT", linkageName: "math._lgamT", scope: !878, file: !878, line: 123, type: !886, isLocal: false, isDefinition: true, align: 64)
!886 = !DICompositeType(tag: DW_TAG_array_type, baseType: !802, size: 960, align: 64, elements: !5)
!887 = !DIGlobalVariableExpression(var: !888, expr: !DIExpression())
!888 = distinct !DIGlobalVariable(name: "math._lgamU", linkageName: "math._lgamU", scope: !878, file: !878, line: 140, type: !812, isLocal: false, isDefinition: true, align: 64)
!889 = !DIGlobalVariableExpression(var: !890, expr: !DIExpression())
!890 = distinct !DIGlobalVariable(name: "math._lgamV", linkageName: "math._lgamV", scope: !878, file: !878, line: 148, type: !812, isLocal: false, isDefinition: true, align: 64)
!891 = !DIGlobalVariableExpression(var: !892, expr: !DIExpression())
!892 = distinct !DIGlobalVariable(name: "math._lgamW", linkageName: "math._lgamW", scope: !878, file: !878, line: 156, type: !801, isLocal: false, isDefinition: true, align: 64)
!893 = !DIGlobalVariableExpression(var: !894, expr: !DIExpression())
!894 = distinct !DIGlobalVariable(name: "math.pow10tab", linkageName: "math.pow10tab", scope: !895, file: !895, line: 8, type: !896, isLocal: false, isDefinition: true, align: 64)
!895 = !DIFile(filename: "pow10.go", directory: "/usr/local/go/src/math")
!896 = !DICompositeType(tag: DW_TAG_array_type, baseType: !802, size: 2048, align: 64, elements: !702)
!897 = !DIGlobalVariableExpression(var: !898, expr: !DIExpression())
!898 = distinct !DIGlobalVariable(name: "math.pow10postab32", linkageName: "math.pow10postab32", scope: !895, file: !895, line: 16, type: !899, isLocal: false, isDefinition: true, align: 64)
!899 = !DICompositeType(tag: DW_TAG_array_type, baseType: !802, size: 640, align: 64, elements: !231)
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(name: "math.pow10negtab32", linkageName: "math.pow10negtab32", scope: !895, file: !895, line: 21, type: !902, isLocal: false, isDefinition: true, align: 64)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !802, size: 704, align: 64, elements: !903)
!903 = !{!904}
!904 = !DISubrange(count: 11, lowerBound: 0)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(name: "math._sin", linkageName: "math._sin", scope: !907, file: !907, line: 93, type: !812, isLocal: false, isDefinition: true, align: 64)
!907 = !DIFile(filename: "sin.go", directory: "/usr/local/go/src/math")
!908 = !DIGlobalVariableExpression(var: !909, expr: !DIExpression())
!909 = distinct !DIGlobalVariable(name: "math._cos", linkageName: "math._cos", scope: !907, file: !907, line: 103, type: !812, isLocal: false, isDefinition: true, align: 64)
!910 = !DIGlobalVariableExpression(var: !911, expr: !DIExpression())
!911 = distinct !DIGlobalVariable(name: "math._tanP", linkageName: "math._tanP", scope: !912, file: !912, line: 63, type: !913, isLocal: false, isDefinition: true, align: 64)
!912 = !DIFile(filename: "tan.go", directory: "/usr/local/go/src/math")
!913 = !DICompositeType(tag: DW_TAG_array_type, baseType: !802, size: 192, align: 64, elements: !57)
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(name: "math._tanQ", linkageName: "math._tanQ", scope: !912, file: !912, line: 68, type: !808, isLocal: false, isDefinition: true, align: 64)
!916 = !DIGlobalVariableExpression(var: !917, expr: !DIExpression())
!917 = distinct !DIGlobalVariable(name: "math.tanhP", linkageName: "math.tanhP", scope: !918, file: !918, line: 57, type: !913, isLocal: false, isDefinition: true, align: 64)
!918 = !DIFile(filename: "tanh.go", directory: "/usr/local/go/src/math")
!919 = !DIGlobalVariableExpression(var: !920, expr: !DIExpression())
!920 = distinct !DIGlobalVariable(name: "math.tanhQ", linkageName: "math.tanhQ", scope: !918, file: !918, line: 62, type: !913, isLocal: false, isDefinition: true, align: 64)
!921 = !DIGlobalVariableExpression(var: !922, expr: !DIExpression())
!922 = distinct !DIGlobalVariable(name: "math.mPi4", linkageName: "math.mPi4", scope: !923, file: !923, line: 81, type: !924, isLocal: false, isDefinition: true, align: 64)
!923 = !DIFile(filename: "trig_reduce.go", directory: "/usr/local/go/src/math")
!924 = !DICompositeType(tag: DW_TAG_array_type, baseType: !345, size: 1280, align: 64, elements: !396)
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(scope: null, file: !927, line: 1, type: !3, isLocal: true, isDefinition: true)
!927 = !DIFile(filename: "exp2_noasm.go", directory: "/usr/local/go/src/math")
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(name: "type *string", scope: !88, file: !88, line: 1, type: !97, isLocal: false, isDefinition: true, align: 64)
!930 = !DIGlobalVariableExpression(var: !931, expr: !DIExpression())
!931 = distinct !DIGlobalVariable(name: "type string", scope: !88, file: !88, line: 1, type: !89, isLocal: false, isDefinition: true, align: 64)
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression())
!933 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!936 = !DIGlobalVariableExpression(var: !937, expr: !DIExpression())
!937 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!940 = !DIGlobalVariableExpression(var: !941, expr: !DIExpression())
!941 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!950 = !DIGlobalVariableExpression(var: !951, expr: !DIExpression())
!951 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!952 = !DIGlobalVariableExpression(var: !953, expr: !DIExpression())
!953 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!954 = !DIGlobalVariableExpression(var: !955, expr: !DIExpression())
!955 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!956 = !DIGlobalVariableExpression(var: !957, expr: !DIExpression())
!957 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!960 = !DIGlobalVariableExpression(var: !961, expr: !DIExpression())
!961 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!964 = !DIGlobalVariableExpression(var: !965, expr: !DIExpression())
!965 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!968 = !DIGlobalVariableExpression(var: !969, expr: !DIExpression())
!969 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!970 = !DIGlobalVariableExpression(var: !971, expr: !DIExpression())
!971 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!976 = distinct !DICompileUnit(language: DW_LANG_C99, file: !524, producer: "TinyGo", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !977)
!977 = !{!978, !984, !986, !988, !993, !995, !1000, !1005, !1010, !1015}
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(scope: null, file: !980, line: 1, type: !981, isLocal: true, isDefinition: true)
!980 = !DIFile(filename: "value.go", directory: "/usr/local/go/src/sync/atomic")
!981 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 424, align: 8, elements: !982)
!982 = !{!983}
!983 = !DISubrange(count: 53, lowerBound: 0)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(name: "type *string", scope: !88, file: !88, line: 1, type: !97, isLocal: false, isDefinition: true, align: 64)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(name: "type string", scope: !88, file: !88, line: 1, type: !89, isLocal: false, isDefinition: true, align: 64)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(scope: null, file: !980, line: 1, type: !990, isLocal: true, isDefinition: true)
!990 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, align: 8, elements: !991)
!991 = !{!992}
!992 = !DISubrange(count: 60, lowerBound: 0)
!993 = !DIGlobalVariableExpression(var: !994, expr: !DIExpression())
!994 = distinct !DIGlobalVariable(name: "sync/atomic.firstStoreInProgress", linkageName: "sync/atomic.firstStoreInProgress", scope: !980, file: !980, line: 42, type: !540, isLocal: false, isDefinition: true, align: 8)
!995 = !DIGlobalVariableExpression(var: !996, expr: !DIExpression())
!996 = distinct !DIGlobalVariable(scope: null, file: !980, line: 1, type: !997, isLocal: true, isDefinition: true)
!997 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 560, align: 8, elements: !998)
!998 = !{!999}
!999 = !DISubrange(count: 70, lowerBound: 0)
!1000 = !DIGlobalVariableExpression(var: !1001, expr: !DIExpression())
!1001 = distinct !DIGlobalVariable(scope: null, file: !980, line: 1, type: !1002, isLocal: true, isDefinition: true)
!1002 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, align: 8, elements: !1003)
!1003 = !{!1004}
!1004 = !DISubrange(count: 42, lowerBound: 0)
!1005 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression())
!1006 = distinct !DIGlobalVariable(scope: null, file: !980, line: 1, type: !1007, isLocal: true, isDefinition: true)
!1007 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 472, align: 8, elements: !1008)
!1008 = !{!1009}
!1009 = !DISubrange(count: 59, lowerBound: 0)
!1010 = !DIGlobalVariableExpression(var: !1011, expr: !DIExpression())
!1011 = distinct !DIGlobalVariable(scope: null, file: !980, line: 1, type: !1012, isLocal: true, isDefinition: true)
!1012 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, align: 8, elements: !1013)
!1013 = !{!1014}
!1014 = !DISubrange(count: 41, lowerBound: 0)
!1015 = !DIGlobalVariableExpression(var: !1016, expr: !DIExpression())
!1016 = distinct !DIGlobalVariable(scope: null, file: !980, line: 1, type: !1017, isLocal: true, isDefinition: true)
!1017 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 464, align: 8, elements: !1018)
!1018 = !{!1019}
!1019 = !DISubrange(count: 58, lowerBound: 0)
!1020 = distinct !DICompileUnit(language: DW_LANG_C99, file: !524, producer: "TinyGo", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!1021 = distinct !DICompileUnit(language: DW_LANG_C99, file: !524, producer: "TinyGo", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!1022 = distinct !DICompileUnit(language: DW_LANG_C99, file: !524, producer: "TinyGo", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1023)
