; ModuleID = 'main'
source_filename = "main"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-musleabihf"

%runtime._string = type { ptr, i64 }
%"unicode/utf8.acceptRange" = type { i8, i8 }
%"internal/task.Task" = type { ptr, ptr, i64, %"sync/atomic.noCopy", %"internal/task.state", i8, i1, i8, ptr }
%"sync/atomic.noCopy" = type {}
%"internal/task.state" = type { i64, ptr, i64, i64, ptr, %"internal/task.Semaphore" }
%"internal/task.Semaphore" = type { %"internal/futex.Futex" }
%"internal/futex.Futex" = type { %"sync/atomic.Bool" }
%"sync/atomic.Bool" = type { %"sync/atomic.noCopy", i32 }
%runtime.elfHeader = type { i32, i8, i8, i8, i8, i8, [7 x i8], i16, i16, i32, i64, i64, i64, i32, i16, i16, i16, i16, i16, i16 }
%"internal/reflectlite.RawType" = type { i8 }
%"internal/reflectlite.ptrType" = type { %"internal/reflectlite.RawType", i16, ptr, %"internal/reflectlite.methodSet" }
%"internal/reflectlite.methodSet" = type { i64, [0 x ptr] }
%"internal/reflectlite.elemType" = type { %"internal/reflectlite.RawType", i16, ptr, ptr }
%"internal/reflectlite.arrayType" = type { %"internal/reflectlite.RawType", i16, ptr, ptr, i64, ptr }
%"internal/reflectlite.structType" = type { %"internal/reflectlite.RawType", i16, ptr, ptr, i32, i16, [1 x { ptr, ptr }] }
%"internal/reflectlite.rawStructField" = type { %runtime._string, %runtime._string, ptr, %runtime._string, i64, i1 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "stubs.go", directory: "/usr/local/go/src/math")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, align: 8, elements: !5)
!4 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!5 = !{!6}
!6 = !DISubrange(count: 15, lowerBound: 0)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !9, line: 12, type: !10, isLocal: true, isDefinition: true)
!9 = !DIFile(filename: "itoa.go", directory: "/usr/local/lib/tinygo/src/internal/itoa")
!10 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, align: 8, elements: !11)
!11 = !{!12}
!12 = !DISubrange(count: 1, lowerBound: 0)
!13 = !DIGlobalVariableExpression(var: !14, expr: !DIExpression())
!14 = distinct !DIGlobalVariable(scope: null, file: !9, line: 20, type: !10, isLocal: true, isDefinition: true)
!15 = !DIGlobalVariableExpression(var: !16, expr: !DIExpression())
!16 = distinct !DIGlobalVariable(name: "unicode/utf8.first", linkageName: "unicode/utf8.first", scope: !17, file: !17, line: 71, type: !18, isLocal: false, isDefinition: true, align: 8)
!17 = !DIFile(filename: "utf8.go", directory: "/usr/local/lib/tinygo/src/unicode/utf8")
!18 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, align: 8, elements: !19)
!19 = !{!20}
!20 = !DISubrange(count: 256, lowerBound: 0)
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "unicode/utf8.acceptRanges", linkageName: "unicode/utf8.acceptRanges", scope: !17, file: !17, line: 100, type: !23, isLocal: false, isDefinition: true, align: 8)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 256, align: 8, elements: !29)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "unicode/utf8.acceptRange", baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_structure_type, size: 16, align: 8, elements: !26)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "lo", baseType: !4, size: 8, align: 8)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "hi", baseType: !4, size: 8, align: 8, offset: 8)
!29 = !{!30}
!30 = !DISubrange(count: 16, lowerBound: 0)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(scope: null, file: !33, line: 393, type: !34, isLocal: true, isDefinition: true)
!33 = !DIFile(filename: "type.go", directory: "/usr/local/lib/tinygo/src/internal/reflectlite")
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, align: 8, elements: !35)
!35 = !{!36}
!36 = !DISubrange(count: 4, lowerBound: 0)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "internal/reflectlite.errTypeElem", linkageName: "internal/reflectlite.errTypeElem", scope: !33, file: !33, line: 393, type: !39, isLocal: false, isDefinition: true, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64, dwarfAddressSpace: 0)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "internal/reflectlite.TypeError", baseType: !41)
!41 = !DICompositeType(tag: DW_TAG_structure_type, size: 128, align: 64, elements: !42)
!42 = !{!43}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "Method", baseType: !44, size: 128, align: 64)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", size: 128, align: 64, elements: !45)
!45 = !{!46, !48}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64, dwarfAddressSpace: 0)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "len", baseType: !49, size: 64, align: 64, offset: 64)
!49 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(scope: null, file: !33, line: 394, type: !52, isLocal: true, isDefinition: true)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, align: 8, elements: !53)
!53 = !{!54}
!54 = !DISubrange(count: 3, lowerBound: 0)
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "internal/reflectlite.errTypeKey", linkageName: "internal/reflectlite.errTypeKey", scope: !33, file: !33, line: 394, type: !39, isLocal: false, isDefinition: true, align: 64)
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(scope: null, file: !33, line: 395, type: !59, isLocal: true, isDefinition: true)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, align: 8, elements: !60)
!60 = !{!61}
!61 = !DISubrange(count: 5, lowerBound: 0)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "internal/reflectlite.errTypeField", linkageName: "internal/reflectlite.errTypeField", scope: !33, file: !33, line: 395, type: !39, isLocal: false, isDefinition: true, align: 64)
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(scope: null, file: !33, line: 397, type: !52, isLocal: true, isDefinition: true)
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(name: "internal/reflectlite.errTypeLen", linkageName: "internal/reflectlite.errTypeLen", scope: !33, file: !33, line: 397, type: !39, isLocal: false, isDefinition: true, align: 64)
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(scope: null, file: !33, line: 398, type: !70, isLocal: true, isDefinition: true)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, align: 8, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 8, lowerBound: 0)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "internal/reflectlite.errTypeNumField", linkageName: "internal/reflectlite.errTypeNumField", scope: !33, file: !33, line: 398, type: !39, isLocal: false, isDefinition: true, align: 64)
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(scope: null, file: !33, line: 399, type: !77, isLocal: true, isDefinition: true)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, align: 8, elements: !78)
!78 = !{!79}
!79 = !DISubrange(count: 7, lowerBound: 0)
!80 = !DIGlobalVariableExpression(var: !81, expr: !DIExpression())
!81 = distinct !DIGlobalVariable(name: "internal/reflectlite.errTypeChanDir", linkageName: "internal/reflectlite.errTypeChanDir", scope: !33, file: !33, line: 399, type: !39, isLocal: false, isDefinition: true, align: 64)
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(name: "type uint8", scope: !84, file: !84, line: 1, type: !85, isLocal: false, isDefinition: true, align: 64)
!84 = !DIFile(filename: "<Go type>", directory: "")
!85 = !DICompositeType(tag: DW_TAG_structure_type, size: 128, align: 64, elements: !86)
!86 = !{!87, !89}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "kind", baseType: !88, size: 8, align: 8)
!88 = !DIBasicType(name: "int8", size: 8, encoding: DW_ATE_signed)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ptrTo", baseType: !90, size: 64, align: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe.Pointer", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "type *uint8", scope: !84, file: !84, line: 1, type: !93, isLocal: false, isDefinition: true, align: 64)
!93 = !DICompositeType(tag: DW_TAG_structure_type, size: 128, align: 64, elements: !94)
!94 = !{!87, !95, !97}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "numMethods", baseType: !96, size: 16, align: 16, offset: 16)
!96 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "elementType", baseType: !90, size: 64, align: 64, offset: 64)
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(name: "type struct{meta uint8}", scope: !84, file: !84, line: 1, type: !100, isLocal: false, isDefinition: true, align: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, size: 384, align: 64, elements: !101)
!101 = !{!87, !95, !89, !102, !103, !105, !106}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "pkgpath", baseType: !90, size: 64, align: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "size", baseType: !104, size: 32, align: 32, offset: 192)
!104 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "numFields", baseType: !96, size: 16, align: 16, offset: 224)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "fields", baseType: !107, size: 128, align: 64, offset: 256)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 128, align: 64, elements: !11)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "runtime.structField", baseType: !109)
!109 = !DICompositeType(tag: DW_TAG_structure_type, size: 128, align: 64, elements: !110)
!110 = !{!111, !112}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", baseType: !90, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "data", baseType: !47, size: 64, align: 64, offset: 64)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(name: "type *struct{meta uint8}", scope: !84, file: !84, line: 1, type: !93, isLocal: false, isDefinition: true, align: 64)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(scope: null, file: !117, line: 17, type: !118, isLocal: true, isDefinition: true)
!117 = !DIFile(filename: "strconv.go", directory: "/usr/local/lib/tinygo/src/internal/reflectlite")
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, align: 8, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 14, lowerBound: 0)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "type struct{}", scope: !84, file: !84, line: 1, type: !123, isLocal: false, isDefinition: true, align: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, size: 256, align: 64, elements: !124)
!124 = !{!87, !95, !89, !102, !103, !105, !125}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "fields", baseType: !126, align: 64, offset: 256)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, align: 64, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 0, lowerBound: 0)
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "type *struct{}", scope: !84, file: !84, line: 1, type: !93, isLocal: false, isDefinition: true, align: 64)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(scope: null, file: !117, line: 250, type: !133, isLocal: true, isDefinition: true)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, align: 8, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 2, lowerBound: 0)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(scope: null, file: !117, line: 251, type: !3, isLocal: true, isDefinition: true)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(scope: null, file: !117, line: 252, type: !3, isLocal: true, isDefinition: true)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(scope: null, file: !117, line: 278, type: !133, isLocal: true, isDefinition: true)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(scope: null, file: !117, line: 280, type: !133, isLocal: true, isDefinition: true)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(scope: null, file: !117, line: 282, type: !133, isLocal: true, isDefinition: true)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(scope: null, file: !117, line: 284, type: !133, isLocal: true, isDefinition: true)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(scope: null, file: !117, line: 286, type: !133, isLocal: true, isDefinition: true)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(scope: null, file: !117, line: 288, type: !133, isLocal: true, isDefinition: true)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(scope: null, file: !117, line: 290, type: !133, isLocal: true, isDefinition: true)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(scope: null, file: !117, line: 294, type: !133, isLocal: true, isDefinition: true)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(scope: null, file: !117, line: 295, type: !3, isLocal: true, isDefinition: true)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(scope: null, file: !117, line: 296, type: !3, isLocal: true, isDefinition: true)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(scope: null, file: !117, line: 301, type: !133, isLocal: true, isDefinition: true)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(scope: null, file: !117, line: 303, type: !3, isLocal: true, isDefinition: true)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(scope: null, file: !117, line: 306, type: !133, isLocal: true, isDefinition: true)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(scope: null, file: !117, line: 308, type: !3, isLocal: true, isDefinition: true)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "type internal/reflectlite.ValueError", scope: !84, file: !84, line: 1, type: !170, isLocal: false, isDefinition: true, align: 64)
!170 = !DICompositeType(tag: DW_TAG_structure_type, size: 448, align: 64, elements: !171)
!171 = !{!87, !95, !89, !172, !173, !174}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "underlying", baseType: !90, size: 64, align: 64, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "pkgpath", baseType: !90, size: 64, align: 64, offset: 192)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "name", baseType: !175, size: 184, align: 8, offset: 256)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 184, align: 8, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 23, lowerBound: 0)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "type struct{Method string; Kind internal/reflectlite.Kind}", scope: !84, file: !84, line: 1, type: !180, isLocal: false, isDefinition: true, align: 64)
!180 = !DICompositeType(tag: DW_TAG_structure_type, size: 512, align: 64, elements: !181)
!181 = !{!87, !95, !89, !102, !103, !105, !182}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "fields", baseType: !183, size: 256, align: 64, offset: 256)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 256, align: 64, elements: !134)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(name: "type *struct{Method string; Kind internal/reflectlite.Kind}", scope: !84, file: !84, line: 1, type: !93, isLocal: false, isDefinition: true, align: 64)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(scope: null, file: !33, line: 60, type: !77, isLocal: true, isDefinition: true)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(scope: null, file: !33, line: 62, type: !34, isLocal: true, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(scope: null, file: !33, line: 64, type: !52, isLocal: true, isDefinition: true)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(scope: null, file: !33, line: 66, type: !34, isLocal: true, isDefinition: true)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(scope: null, file: !33, line: 68, type: !59, isLocal: true, isDefinition: true)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(scope: null, file: !33, line: 70, type: !59, isLocal: true, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(scope: null, file: !33, line: 72, type: !59, isLocal: true, isDefinition: true)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(scope: null, file: !33, line: 74, type: !34, isLocal: true, isDefinition: true)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(scope: null, file: !33, line: 76, type: !59, isLocal: true, isDefinition: true)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(scope: null, file: !33, line: 78, type: !206, isLocal: true, isDefinition: true)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, align: 8, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 6, lowerBound: 0)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(scope: null, file: !33, line: 80, type: !206, isLocal: true, isDefinition: true)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(scope: null, file: !33, line: 82, type: !206, isLocal: true, isDefinition: true)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(scope: null, file: !33, line: 84, type: !77, isLocal: true, isDefinition: true)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(scope: null, file: !33, line: 86, type: !77, isLocal: true, isDefinition: true)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(scope: null, file: !33, line: 88, type: !77, isLocal: true, isDefinition: true)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(scope: null, file: !33, line: 90, type: !221, isLocal: true, isDefinition: true)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, align: 8, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 9, lowerBound: 0)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(scope: null, file: !33, line: 92, type: !226, isLocal: true, isDefinition: true)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, align: 8, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 10, lowerBound: 0)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(scope: null, file: !33, line: 94, type: !206, isLocal: true, isDefinition: true)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(scope: null, file: !33, line: 96, type: !118, isLocal: true, isDefinition: true)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(scope: null, file: !33, line: 98, type: !34, isLocal: true, isDefinition: true)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(scope: null, file: !33, line: 100, type: !221, isLocal: true, isDefinition: true)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(scope: null, file: !33, line: 102, type: !52, isLocal: true, isDefinition: true)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(scope: null, file: !33, line: 104, type: !59, isLocal: true, isDefinition: true)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(scope: null, file: !33, line: 106, type: !59, isLocal: true, isDefinition: true)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(scope: null, file: !33, line: 108, type: !34, isLocal: true, isDefinition: true)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(scope: null, file: !33, line: 110, type: !52, isLocal: true, isDefinition: true)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(scope: null, file: !33, line: 112, type: !206, isLocal: true, isDefinition: true)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(scope: null, file: !33, line: 114, type: !34, isLocal: true, isDefinition: true)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "type internal/reflectlite.TypeError", scope: !84, file: !84, line: 1, type: !253, isLocal: false, isDefinition: true, align: 64)
!253 = !DICompositeType(tag: DW_TAG_structure_type, size: 448, align: 64, elements: !254)
!254 = !{!87, !95, !89, !172, !173, !255}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "name", baseType: !256, size: 176, align: 8, offset: 256)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 176, align: 8, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 22, lowerBound: 0)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(name: "type struct{Method string}", scope: !84, file: !84, line: 1, type: !100, isLocal: false, isDefinition: true, align: 64)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "type *struct{Method string}", scope: !84, file: !84, line: 1, type: !93, isLocal: false, isDefinition: true, align: 64)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(scope: null, file: !33, line: 329, type: !77, isLocal: true, isDefinition: true)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(scope: null, file: !33, line: 331, type: !77, isLocal: true, isDefinition: true)
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(scope: null, file: !33, line: 338, type: !206, isLocal: true, isDefinition: true)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(scope: null, file: !33, line: 338, type: !10, isLocal: true, isDefinition: true)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(scope: null, file: !33, line: 340, type: !59, isLocal: true, isDefinition: true)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(scope: null, file: !33, line: 344, type: !10, isLocal: true, isDefinition: true)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(scope: null, file: !33, line: 346, type: !133, isLocal: true, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(scope: null, file: !33, line: 348, type: !10, isLocal: true, isDefinition: true)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(scope: null, file: !33, line: 348, type: !10, isLocal: true, isDefinition: true)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(scope: null, file: !33, line: 350, type: !34, isLocal: true, isDefinition: true)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(scope: null, file: !33, line: 350, type: !10, isLocal: true, isDefinition: true)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(scope: null, file: !33, line: 354, type: !221, isLocal: true, isDefinition: true)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(scope: null, file: !33, line: 359, type: !10, isLocal: true, isDefinition: true)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(scope: null, file: !33, line: 359, type: !10, isLocal: true, isDefinition: true)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(scope: null, file: !33, line: 361, type: !10, isLocal: true, isDefinition: true)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(scope: null, file: !33, line: 365, type: !10, isLocal: true, isDefinition: true)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(scope: null, file: !33, line: 368, type: !133, isLocal: true, isDefinition: true)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(scope: null, file: !33, line: 372, type: !299, isLocal: true, isDefinition: true)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, align: 8, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 12, lowerBound: 0)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(scope: null, file: !33, line: 356, type: !70, isLocal: true, isDefinition: true)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(scope: null, file: !33, line: 1, type: !306, isLocal: true, isDefinition: true)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, align: 8, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 33, lowerBound: 0)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(scope: null, file: !33, line: 1212, type: !311, isLocal: true, isDefinition: true)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, align: 8, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 30, lowerBound: 0)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(scope: null, file: !33, line: 1212, type: !316, isLocal: true, isDefinition: true)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, align: 8, elements: !29)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(scope: null, file: !319, line: 1791, type: !320, isLocal: true, isDefinition: true)
!319 = !DIFile(filename: "value.go", directory: "/usr/local/lib/tinygo/src/internal/reflectlite")
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, align: 8, elements: !321)
!321 = !{!322}
!322 = !DISubrange(count: 17, lowerBound: 0)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(scope: null, file: !319, line: 1791, type: !118, isLocal: true, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(scope: null, file: !319, line: 1793, type: !320, isLocal: true, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(scope: null, file: !319, line: 1793, type: !34, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(scope: null, file: !319, line: 1793, type: !206, isLocal: true, isDefinition: true)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "internal/task.activeTasks", linkageName: "internal/task.activeTasks", scope: !333, file: !333, line: 45, type: !334, isLocal: false, isDefinition: true, align: 64)
!333 = !DIFile(filename: "task_threads.go", directory: "/usr/local/lib/tinygo/src/internal/task")
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64, dwarfAddressSpace: 0)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "internal/task.Task", baseType: !336)
!336 = !DICompositeType(tag: DW_TAG_structure_type, size: 704, align: 64, elements: !337)
!337 = !{!338, !339, !340, !342, !346, !372, !373, !375, !376}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "Next", baseType: !334, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "Ptr", baseType: !90, size: 64, align: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "Data", baseType: !341, size: 64, align: 64, offset: 128)
!341 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "gcData", baseType: !343, align: 8, offset: 192)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "internal/task.gcData", baseType: !344)
!344 = !DICompositeType(tag: DW_TAG_structure_type, align: 8, elements: !345)
!345 = !{}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "state", baseType: !347, size: 384, align: 64, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "internal/task.state", baseType: !348)
!348 = !DICompositeType(tag: DW_TAG_structure_type, size: 384, align: 64, elements: !349)
!349 = !{!350, !351, !353, !354, !355, !356}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "id", baseType: !49, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "thread", baseType: !352, size: 64, align: 64, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "internal/task.threadID", baseType: !90)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "stackTop", baseType: !49, size: 64, align: 64, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "stackBottom", baseType: !49, size: 64, align: 64, offset: 192)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "QueueNext", baseType: !334, size: 64, align: 64, offset: 256)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "pauseSem", baseType: !357, size: 32, align: 32, offset: 320)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "internal/task.Semaphore", baseType: !358)
!358 = !DICompositeType(tag: DW_TAG_structure_type, size: 32, align: 32, elements: !359)
!359 = !{!360}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "futex", baseType: !361, size: 32, align: 32)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "internal/task.Futex", baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "internal/futex.Futex", baseType: !363)
!363 = !DICompositeType(tag: DW_TAG_structure_type, size: 32, align: 32, elements: !364)
!364 = !{!365}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "Uint32", baseType: !366, size: 32, align: 32)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "sync/atomic.Uint32", baseType: !367)
!367 = !DICompositeType(tag: DW_TAG_structure_type, size: 32, align: 32, elements: !368)
!368 = !{!369, !371}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_", baseType: !370, align: 8)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "sync/atomic.noCopy", baseType: !344)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "v", baseType: !104, size: 32, align: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "FipsIndicator", baseType: !4, size: 8, align: 8, offset: 576)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "FipsOnlyBypass", baseType: !374, size: 8, align: 8, offset: 584)
!374 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "RunState", baseType: !4, size: 8, align: 8, offset: 592)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "DeferFrame", baseType: !90, size: 64, align: 64, offset: 640)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "internal/task.mainTask", linkageName: "internal/task.mainTask", scope: !333, file: !333, line: 42, type: !335, isLocal: false, isDefinition: true, align: 64)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(scope: null, file: !381, line: 1, type: !311, isLocal: true, isDefinition: true)
!381 = !DIFile(filename: "mutex-preemptive.go", directory: "/usr/local/lib/tinygo/src/internal/task")
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "internal/task.numCPU", linkageName: "internal/task.numCPU", scope: !333, file: !333, line: 40, type: !384, isLocal: false, isDefinition: true, align: 32)
!384 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "internal/task.activeTaskLock", linkageName: "internal/task.activeTaskLock", scope: !333, file: !333, line: 46, type: !387, isLocal: false, isDefinition: true, align: 32)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "internal/task.PMutex", baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "internal/task.Mutex", baseType: !358)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(scope: null, file: !333, line: 64, type: !391, isLocal: true, isDefinition: true)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, align: 8, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 20, lowerBound: 0)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(scope: null, file: !333, line: 77, type: !299, isLocal: true, isDefinition: true)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "internal/task.otherGoroutines", linkageName: "internal/task.otherGoroutines", scope: !333, file: !333, line: 99, type: !104, isLocal: false, isDefinition: true, align: 32)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(scope: null, file: !333, line: 127, type: !221, isLocal: true, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(scope: null, file: !333, line: 146, type: !320, isLocal: true, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "internal/task.scanWaitGroup", linkageName: "internal/task.scanWaitGroup", scope: !333, file: !333, line: 151, type: !404, isLocal: false, isDefinition: true, align: 32)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "internal/task.waitGroup", baseType: !405)
!405 = !DICompositeType(tag: DW_TAG_structure_type, size: 32, align: 32, elements: !406)
!406 = !{!407}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "f", baseType: !361, size: 32, align: 32)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "internal/task.gcState", linkageName: "internal/task.gcState", scope: !333, file: !333, line: 180, type: !361, isLocal: false, isDefinition: true, align: 32)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "runtime.xorshift32State", linkageName: "runtime.xorshift32State", scope: !412, file: !412, line: 32, type: !104, isLocal: false, isDefinition: true, align: 32)
!412 = !DIFile(filename: "algorithm.go", directory: "/usr/local/lib/tinygo/src/runtime")
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "runtime.xorshift64State", linkageName: "runtime.xorshift64State", scope: !412, file: !412, line: 52, type: !341, isLocal: false, isDefinition: true, align: 64)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "runtime.heapSize", linkageName: "runtime.heapSize", scope: !417, file: !417, line: 298, type: !49, isLocal: false, isDefinition: true, align: 64)
!417 = !DIFile(filename: "runtime_unix.go", directory: "/usr/local/lib/tinygo/src/runtime")
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "type string", scope: !84, file: !84, line: 1, type: !85, isLocal: false, isDefinition: true, align: 64)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "type *string", scope: !84, file: !84, line: 1, type: !93, isLocal: false, isDefinition: true, align: 64)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(name: "runtime.zeroSizedAlloc", linkageName: "runtime.zeroSizedAlloc", scope: !424, file: !424, line: 30, type: !4, isLocal: false, isDefinition: true, align: 8)
!424 = !DIFile(filename: "gc_boehm.go", directory: "/usr/local/lib/tinygo/src/runtime")
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(name: "runtime.gcLock", linkageName: "runtime.gcLock", scope: !424, file: !424, line: 32, type: !387, isLocal: false, isDefinition: true, align: 32)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(scope: null, file: !424, line: 93, type: !320, isLocal: true, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(scope: null, file: !431, line: 78, type: !77, isLocal: true, isDefinition: true)
!431 = !DIFile(filename: "panic.go", directory: "/usr/local/lib/tinygo/src/runtime")
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(scope: null, file: !431, line: 99, type: !434, isLocal: true, isDefinition: true)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, align: 8, elements: !435)
!435 = !{!436}
!436 = !DISubrange(count: 24, lowerBound: 0)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(scope: null, file: !431, line: 101, type: !133, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(scope: null, file: !431, line: 103, type: !441, isLocal: true, isDefinition: true)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, align: 8, elements: !257)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(scope: null, file: !431, line: 184, type: !444, isLocal: true, isDefinition: true)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, align: 8, elements: !176)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(scope: null, file: !431, line: 194, type: !447, isLocal: true, isDefinition: true)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, align: 8, elements: !448)
!448 = !{!449}
!449 = !DISubrange(count: 18, lowerBound: 0)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !431, line: 199, type: !447, isLocal: true, isDefinition: true)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(scope: null, file: !431, line: 212, type: !454, isLocal: true, isDefinition: true)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, align: 8, elements: !455)
!455 = !{!456}
!456 = !DISubrange(count: 37, lowerBound: 0)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(scope: null, file: !431, line: 222, type: !118, isLocal: true, isDefinition: true)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(scope: null, file: !461, line: 117, type: !52, isLocal: true, isDefinition: true)
!461 = !DIFile(filename: "print.go", directory: "/usr/local/lib/tinygo/src/runtime")
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(scope: null, file: !461, line: 120, type: !34, isLocal: true, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(scope: null, file: !461, line: 123, type: !34, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !461, line: 197, type: !52, isLocal: true, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(scope: null, file: !461, line: 200, type: !34, isLocal: true, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !461, line: 203, type: !34, isLocal: true, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(scope: null, file: !461, line: 272, type: !133, isLocal: true, isDefinition: true)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(scope: null, file: !461, line: 279, type: !133, isLocal: true, isDefinition: true)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(scope: null, file: !461, line: 373, type: !52, isLocal: true, isDefinition: true)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(scope: null, file: !461, line: 391, type: !34, isLocal: true, isDefinition: true)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(scope: null, file: !461, line: 393, type: !59, isLocal: true, isDefinition: true)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(name: "runtime.stackTop", linkageName: "runtime.stackTop", scope: !417, file: !417, line: 75, type: !49, isLocal: false, isDefinition: true, align: 64)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(name: "runtime.main_argc", linkageName: "runtime.main_argc", scope: !417, file: !417, line: 105, type: !384, isLocal: false, isDefinition: true, align: 32)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(name: "runtime.main_argv", linkageName: "runtime.main_argv", scope: !417, file: !417, line: 106, type: !488, isLocal: false, isDefinition: true, align: 64)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64, dwarfAddressSpace: 0)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(scope: null, file: !417, line: 155, type: !434, isLocal: true, isDefinition: true)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(scope: null, file: !417, line: 160, type: !316, isLocal: true, isDefinition: true)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(scope: null, file: !417, line: 163, type: !206, isLocal: true, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(scope: null, file: !417, line: 165, type: !206, isLocal: true, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(scope: null, file: !417, line: 167, type: !77, isLocal: true, isDefinition: true)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(scope: null, file: !417, line: 158, type: !391, isLocal: true, isDefinition: true)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "runtime.signalFutex", linkageName: "runtime.signalFutex", scope: !417, file: !417, line: 354, type: !362, isLocal: false, isDefinition: true, align: 32)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(name: "runtime.heapMaxSize", linkageName: "runtime.heapMaxSize", scope: !417, file: !417, line: 299, type: !49, isLocal: false, isDefinition: true, align: 64)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(name: "runtime.heapStart", linkageName: "runtime.heapStart", scope: !417, file: !417, line: 301, type: !49, isLocal: false, isDefinition: true, align: 64)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "runtime.heapEnd", linkageName: "runtime.heapEnd", scope: !417, file: !417, line: 301, type: !49, isLocal: false, isDefinition: true, align: 64)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(scope: null, file: !417, line: 317, type: !511, isLocal: true, isDefinition: true)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, align: 8, elements: !512)
!512 = !{!513}
!513 = !DISubrange(count: 27, lowerBound: 0)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "runtime.receivedSignals", linkageName: "runtime.receivedSignals", scope: !417, file: !417, line: 358, type: !366, isLocal: false, isDefinition: true, align: 32)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "runtime.printLock", linkageName: "runtime.printLock", scope: !518, file: !518, line: 136, type: !388, isLocal: false, isDefinition: true, align: 32)
!518 = !DIFile(filename: "scheduler_threads.go", directory: "/usr/local/lib/tinygo/src/runtime")
!519 = distinct !DICompileUnit(language: DW_LANG_C99, file: !520, producer: "TinyGo", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!520 = !DIFile(filename: "<unknown>", directory: "")
!521 = distinct !DICompileUnit(language: DW_LANG_C99, file: !520, producer: "TinyGo", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !522)
!522 = !{!523, !526, !575, !583, !598, !608, !614, !623, !649, !656, !662, !677, !679, !681, !683, !685, !687, !689, !691, !693, !695, !700, !702, !707, !709, !712, !714, !716, !718, !720, !722, !724, !726, !728, !730, !732, !734, !736, !738, !740, !742, !744, !746, !748, !750, !752, !754, !756, !758, !420, !418, !764}
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(name: "internal/cpu.CacheLineSize", linkageName: "internal/cpu.CacheLineSize", scope: !525, file: !525, line: 17, type: !49, isLocal: false, isDefinition: true, align: 64)
!525 = !DIFile(filename: "cpu.go", directory: "/usr/local/go/src/internal/cpu")
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(name: "internal/cpu.X86", linkageName: "internal/cpu.X86", scope: !525, file: !525, line: 23, type: !528, isLocal: false, isDefinition: true, align: 8)
!528 = !DICompositeType(tag: DW_TAG_structure_type, size: 1304, align: 8, elements: !529)
!529 = !{!530, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_", baseType: !531, size: 512, align: 8)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "internal/cpu.CacheLinePad", baseType: !532)
!532 = !DICompositeType(tag: DW_TAG_structure_type, size: 512, align: 8, elements: !533)
!533 = !{!534}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_", baseType: !535, size: 512, align: 8)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !536, size: 512, align: 8, elements: !537)
!536 = !DIBasicType(name: "byte", size: 8, encoding: DW_ATE_unsigned)
!537 = !{!538}
!538 = !DISubrange(count: 64, lowerBound: 0)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "HasAES", baseType: !374, size: 8, align: 8, offset: 512)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "HasADX", baseType: !374, size: 8, align: 8, offset: 520)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX", baseType: !374, size: 8, align: 8, offset: 528)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVXVNNI", baseType: !374, size: 8, align: 8, offset: 536)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX2", baseType: !374, size: 8, align: 8, offset: 544)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512", baseType: !374, size: 8, align: 8, offset: 552)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512F", baseType: !374, size: 8, align: 8, offset: 560)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512CD", baseType: !374, size: 8, align: 8, offset: 568)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512BW", baseType: !374, size: 8, align: 8, offset: 576)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512DQ", baseType: !374, size: 8, align: 8, offset: 584)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512VL", baseType: !374, size: 8, align: 8, offset: 592)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512GFNI", baseType: !374, size: 8, align: 8, offset: 600)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512VAES", baseType: !374, size: 8, align: 8, offset: 608)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512VNNI", baseType: !374, size: 8, align: 8, offset: 616)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512VBMI", baseType: !374, size: 8, align: 8, offset: 624)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512VBMI2", baseType: !374, size: 8, align: 8, offset: 632)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512BITALG", baseType: !374, size: 8, align: 8, offset: 640)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512VPOPCNTDQ", baseType: !374, size: 8, align: 8, offset: 648)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512VPCLMULQDQ", baseType: !374, size: 8, align: 8, offset: 656)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "HasBMI1", baseType: !374, size: 8, align: 8, offset: 664)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "HasBMI2", baseType: !374, size: 8, align: 8, offset: 672)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "HasERMS", baseType: !374, size: 8, align: 8, offset: 680)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "HasFSRM", baseType: !374, size: 8, align: 8, offset: 688)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "HasFMA", baseType: !374, size: 8, align: 8, offset: 696)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "HasGFNI", baseType: !374, size: 8, align: 8, offset: 704)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "HasOSXSAVE", baseType: !374, size: 8, align: 8, offset: 712)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "HasPCLMULQDQ", baseType: !374, size: 8, align: 8, offset: 720)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "HasPOPCNT", baseType: !374, size: 8, align: 8, offset: 728)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "HasRDTSCP", baseType: !374, size: 8, align: 8, offset: 736)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "HasSHA", baseType: !374, size: 8, align: 8, offset: 744)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "HasSSE3", baseType: !374, size: 8, align: 8, offset: 752)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "HasSSSE3", baseType: !374, size: 8, align: 8, offset: 760)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "HasSSE41", baseType: !374, size: 8, align: 8, offset: 768)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "HasSSE42", baseType: !374, size: 8, align: 8, offset: 776)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "HasVAES", baseType: !374, size: 8, align: 8, offset: 784)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_", baseType: !531, size: 512, align: 8, offset: 792)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(name: "internal/cpu.ARM", linkageName: "internal/cpu.ARM", scope: !525, file: !525, line: 65, type: !577, isLocal: false, isDefinition: true, align: 8)
!577 = !DICompositeType(tag: DW_TAG_structure_type, size: 1048, align: 8, elements: !578)
!578 = !{!530, !579, !580, !581, !582}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "HasVFPv4", baseType: !374, size: 8, align: 8, offset: 512)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "HasIDIVA", baseType: !374, size: 8, align: 8, offset: 520)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "HasV7Atomics", baseType: !374, size: 8, align: 8, offset: 528)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_", baseType: !531, size: 512, align: 8, offset: 536)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(name: "internal/cpu.ARM64", linkageName: "internal/cpu.ARM64", scope: !525, file: !525, line: 75, type: !585, isLocal: false, isDefinition: true, align: 8)
!585 = !DICompositeType(tag: DW_TAG_structure_type, size: 1112, align: 8, elements: !586)
!586 = !{!530, !539, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "HasPMULL", baseType: !374, size: 8, align: 8, offset: 520)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "HasSHA1", baseType: !374, size: 8, align: 8, offset: 528)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "HasSHA2", baseType: !374, size: 8, align: 8, offset: 536)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "HasSHA512", baseType: !374, size: 8, align: 8, offset: 544)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "HasSHA3", baseType: !374, size: 8, align: 8, offset: 552)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "HasCRC32", baseType: !374, size: 8, align: 8, offset: 560)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "HasATOMICS", baseType: !374, size: 8, align: 8, offset: 568)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "HasCPUID", baseType: !374, size: 8, align: 8, offset: 576)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "HasDIT", baseType: !374, size: 8, align: 8, offset: 584)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "IsNeoverse", baseType: !374, size: 8, align: 8, offset: 592)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_", baseType: !531, size: 512, align: 8, offset: 600)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "internal/cpu.Loong64", linkageName: "internal/cpu.Loong64", scope: !525, file: !525, line: 93, type: !600, isLocal: false, isDefinition: true, align: 8)
!600 = !DICompositeType(tag: DW_TAG_structure_type, size: 1064, align: 8, elements: !601)
!601 = !{!530, !602, !603, !604, !605, !606, !607}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "HasLSX", baseType: !374, size: 8, align: 8, offset: 512)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "HasLASX", baseType: !374, size: 8, align: 8, offset: 520)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "HasCRC32", baseType: !374, size: 8, align: 8, offset: 528)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "HasLAMCAS", baseType: !374, size: 8, align: 8, offset: 536)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "HasLAM_BH", baseType: !374, size: 8, align: 8, offset: 544)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_", baseType: !531, size: 512, align: 8, offset: 552)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(name: "internal/cpu.MIPS64X", linkageName: "internal/cpu.MIPS64X", scope: !525, file: !525, line: 103, type: !610, isLocal: false, isDefinition: true, align: 8)
!610 = !DICompositeType(tag: DW_TAG_structure_type, size: 1032, align: 8, elements: !611)
!611 = !{!530, !612, !613}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "HasMSA", baseType: !374, size: 8, align: 8, offset: 512)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_", baseType: !531, size: 512, align: 8, offset: 520)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(name: "internal/cpu.PPC64", linkageName: "internal/cpu.PPC64", scope: !525, file: !525, line: 114, type: !616, isLocal: false, isDefinition: true, align: 8)
!616 = !DICompositeType(tag: DW_TAG_structure_type, size: 1064, align: 8, elements: !617)
!617 = !{!530, !618, !619, !620, !621, !622, !607}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "HasDARN", baseType: !374, size: 8, align: 8, offset: 512)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "HasSCV", baseType: !374, size: 8, align: 8, offset: 520)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "IsPOWER8", baseType: !374, size: 8, align: 8, offset: 528)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "IsPOWER9", baseType: !374, size: 8, align: 8, offset: 536)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "IsPOWER10", baseType: !374, size: 8, align: 8, offset: 544)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(name: "internal/cpu.S390X", linkageName: "internal/cpu.S390X", scope: !525, file: !525, line: 124, type: !625, isLocal: false, isDefinition: true, align: 8)
!625 = !DICompositeType(tag: DW_TAG_structure_type, size: 1192, align: 8, elements: !626)
!626 = !{!530, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "HasZARCH", baseType: !374, size: 8, align: 8, offset: 512)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "HasSTFLE", baseType: !374, size: 8, align: 8, offset: 520)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "HasLDISP", baseType: !374, size: 8, align: 8, offset: 528)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "HasEIMM", baseType: !374, size: 8, align: 8, offset: 536)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "HasDFP", baseType: !374, size: 8, align: 8, offset: 544)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "HasETF3EH", baseType: !374, size: 8, align: 8, offset: 552)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "HasMSA", baseType: !374, size: 8, align: 8, offset: 560)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "HasAES", baseType: !374, size: 8, align: 8, offset: 568)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "HasAESCBC", baseType: !374, size: 8, align: 8, offset: 576)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "HasAESCTR", baseType: !374, size: 8, align: 8, offset: 584)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "HasAESGCM", baseType: !374, size: 8, align: 8, offset: 592)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "HasGHASH", baseType: !374, size: 8, align: 8, offset: 600)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "HasSHA1", baseType: !374, size: 8, align: 8, offset: 608)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "HasSHA256", baseType: !374, size: 8, align: 8, offset: 616)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "HasSHA512", baseType: !374, size: 8, align: 8, offset: 624)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "HasSHA3", baseType: !374, size: 8, align: 8, offset: 632)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "HasVX", baseType: !374, size: 8, align: 8, offset: 640)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "HasVXE", baseType: !374, size: 8, align: 8, offset: 648)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "HasKDSA", baseType: !374, size: 8, align: 8, offset: 656)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "HasECDSA", baseType: !374, size: 8, align: 8, offset: 664)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "HasEDDSA", baseType: !374, size: 8, align: 8, offset: 672)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_", baseType: !531, size: 512, align: 8, offset: 680)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(name: "internal/cpu.RISCV64", linkageName: "internal/cpu.RISCV64", scope: !525, file: !525, line: 154, type: !651, isLocal: false, isDefinition: true, align: 8)
!651 = !DICompositeType(tag: DW_TAG_structure_type, size: 1048, align: 8, elements: !652)
!652 = !{!530, !653, !654, !655, !582}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "HasFastMisaligned", baseType: !374, size: 8, align: 8, offset: 512)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "HasV", baseType: !374, size: 8, align: 8, offset: 520)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "HasZbb", baseType: !374, size: 8, align: 8, offset: 528)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(name: "internal/cpu.doDerived", linkageName: "internal/cpu.doDerived", scope: !525, file: !525, line: 174, type: !658, isLocal: false, isDefinition: true, align: 64)
!658 = !DICompositeType(tag: DW_TAG_structure_type, size: 128, align: 64, elements: !659)
!659 = !{!660, !661}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "context", baseType: !90, size: 64, align: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "fn", baseType: !90, size: 64, align: 64, offset: 64)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(name: "internal/cpu.options", linkageName: "internal/cpu.options", scope: !525, file: !525, line: 192, type: !664, isLocal: false, isDefinition: true, align: 64)
!664 = !DICompositeType(tag: DW_TAG_structure_type, name: "[]internal/cpu.option", size: 192, align: 64, elements: !665)
!665 = !{!666, !48, !676}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", baseType: !667, size: 64, align: 64)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64, align: 64, dwarfAddressSpace: 0)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "internal/cpu.option", baseType: !669)
!669 = !DICompositeType(tag: DW_TAG_structure_type, size: 256, align: 64, elements: !670)
!670 = !{!671, !672, !674, !675}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "Name", baseType: !44, size: 128, align: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "Feature", baseType: !673, size: 64, align: 64, offset: 128)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64, align: 64, dwarfAddressSpace: 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "Specified", baseType: !374, size: 8, align: 8, offset: 192)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "Enable", baseType: !374, size: 8, align: 8, offset: 200)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "cap", baseType: !49, size: 64, align: 64, offset: 128)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(scope: null, file: !525, line: 218, type: !34, isLocal: true, isDefinition: true)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(scope: null, file: !525, line: 223, type: !306, isLocal: true, isDefinition: true)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(scope: null, file: !525, line: 223, type: !133, isLocal: true, isDefinition: true)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(scope: null, file: !525, line: 230, type: !133, isLocal: true, isDefinition: true)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(scope: null, file: !525, line: 239, type: !52, isLocal: true, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(scope: null, file: !525, line: 255, type: !311, isLocal: true, isDefinition: true)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(scope: null, file: !525, line: 255, type: !133, isLocal: true, isDefinition: true)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(scope: null, file: !525, line: 232, type: !52, isLocal: true, isDefinition: true)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(scope: null, file: !525, line: 235, type: !316, isLocal: true, isDefinition: true)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(scope: null, file: !525, line: 235, type: !697, isLocal: true, isDefinition: true)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, align: 8, elements: !698)
!698 = !{!699}
!699 = !DISubrange(count: 32, lowerBound: 0)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(scope: null, file: !525, line: 235, type: !133, isLocal: true, isDefinition: true)
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(scope: null, file: !525, line: 264, type: !704, isLocal: true, isDefinition: true)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, align: 8, elements: !705)
!705 = !{!706}
!706 = !DISubrange(count: 25, lowerBound: 0)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(scope: null, file: !525, line: 264, type: !444, isLocal: true, isDefinition: true)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "internal/cpu.maxExtendedFunctionInformation", linkageName: "internal/cpu.maxExtendedFunctionInformation", scope: !711, file: !711, line: 69, type: !104, isLocal: false, isDefinition: true, align: 32)
!711 = !DIFile(filename: "cpu_x86.go", directory: "/usr/local/go/src/internal/cpu")
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(scope: null, file: !711, line: 73, type: !52, isLocal: true, isDefinition: true)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(scope: null, file: !711, line: 74, type: !52, isLocal: true, isDefinition: true)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(scope: null, file: !711, line: 75, type: !34, isLocal: true, isDefinition: true)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(scope: null, file: !711, line: 76, type: !34, isLocal: true, isDefinition: true)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(scope: null, file: !711, line: 77, type: !221, isLocal: true, isDefinition: true)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(scope: null, file: !711, line: 78, type: !206, isLocal: true, isDefinition: true)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(scope: null, file: !711, line: 79, type: !52, isLocal: true, isDefinition: true)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(scope: null, file: !711, line: 80, type: !226, isLocal: true, isDefinition: true)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(scope: null, file: !711, line: 87, type: !206, isLocal: true, isDefinition: true)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(scope: null, file: !711, line: 88, type: !34, isLocal: true, isDefinition: true)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(scope: null, file: !711, line: 89, type: !59, isLocal: true, isDefinition: true)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(scope: null, file: !711, line: 90, type: !59, isLocal: true, isDefinition: true)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(scope: null, file: !711, line: 91, type: !59, isLocal: true, isDefinition: true)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(scope: null, file: !711, line: 97, type: !52, isLocal: true, isDefinition: true)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(scope: null, file: !711, line: 98, type: !34, isLocal: true, isDefinition: true)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(scope: null, file: !711, line: 99, type: !34, isLocal: true, isDefinition: true)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(scope: null, file: !711, line: 100, type: !34, isLocal: true, isDefinition: true)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(scope: null, file: !711, line: 101, type: !52, isLocal: true, isDefinition: true)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(scope: null, file: !711, line: 107, type: !77, isLocal: true, isDefinition: true)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(scope: null, file: !711, line: 108, type: !70, isLocal: true, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(scope: null, file: !711, line: 109, type: !70, isLocal: true, isDefinition: true)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(scope: null, file: !711, line: 110, type: !70, isLocal: true, isDefinition: true)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(scope: null, file: !711, line: 111, type: !70, isLocal: true, isDefinition: true)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(scope: null, file: !760, line: 1, type: !761, isLocal: true, isDefinition: true)
!760 = !DIFile(filename: "datacache_x86.go", directory: "/usr/local/go/src/internal/cpu")
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, align: 8, elements: !762)
!762 = !{!763}
!763 = !DISubrange(count: 13, lowerBound: 0)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(scope: null, file: !760, line: 1, type: !766, isLocal: true, isDefinition: true)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 664, align: 8, elements: !767)
!767 = !{!768}
!768 = !DISubrange(count: 83, lowerBound: 0)
!769 = distinct !DICompileUnit(language: DW_LANG_C99, file: !520, producer: "TinyGo", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !770)
!770 = !{!771, !775, !777, !785}
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(name: "math/bits.deBruijn32tab", linkageName: "math/bits.deBruijn32tab", scope: !773, file: !773, line: 44, type: !774, isLocal: false, isDefinition: true, align: 8)
!773 = !DIFile(filename: "bits.go", directory: "/usr/local/go/src/math/bits")
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !536, size: 256, align: 8, elements: !698)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(name: "math/bits.deBruijn64tab", linkageName: "math/bits.deBruijn64tab", scope: !773, file: !773, line: 51, type: !535, isLocal: false, isDefinition: true, align: 8)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(name: "math/bits.overflowError", linkageName: "runtime.overflowError", scope: !779, file: !779, line: 12, type: !780, isLocal: false, isDefinition: true, align: 64)
!779 = !DIFile(filename: "bits_errors.go", directory: "/usr/local/go/src/math/bits")
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "error", baseType: !781)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "runtime._interface", baseType: !782)
!782 = !DICompositeType(tag: DW_TAG_structure_type, size: 128, align: 64, elements: !783)
!783 = !{!111, !784}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "value", baseType: !90, size: 64, align: 64, offset: 64)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(name: "math/bits.divideError", linkageName: "runtime.divideError", scope: !779, file: !779, line: 15, type: !780, isLocal: false, isDefinition: true, align: 64)
!787 = distinct !DICompileUnit(language: DW_LANG_C99, file: !520, producer: "TinyGo", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !788)
!788 = !{!789, !791, !794, !799, !802, !805, !809, !811, !813, !815, !817, !819, !821, !823, !825, !827, !829, !831, !833, !835, !837, !839, !842, !844, !846, !848, !850, !852, !854, !856, !858, !860, !862, !864, !866, !868, !870, !872, !876, !878, !880, !883, !885, !887, !889, !893, !896, !901, !904, !906, !910, !912, !915, !917, !921, !924, !926, !928, !930, !932, !934, !936, !938, !940, !942, !944, !946, !948, !950, !952, !954, !956, !0, !958, !960, !962, !964, !966, !968, !970, !972, !974}
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(name: "internal/cpu.X86", linkageName: "internal/cpu.X86", scope: !525, file: !525, line: 23, type: !528, isLocal: false, isDefinition: true, align: 8)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(name: "math.useFMA", linkageName: "math.useFMA", scope: !793, file: !793, line: 11, type: !374, isLocal: false, isDefinition: true, align: 8)
!793 = !DIFile(filename: "exp_amd64.go", directory: "/usr/local/go/src/math")
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(name: "math._gamP", linkageName: "math._gamP", scope: !796, file: !796, line: 66, type: !797, isLocal: false, isDefinition: true, align: 64)
!796 = !DIFile(filename: "gamma.go", directory: "/usr/local/go/src/math")
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !798, size: 448, align: 64, elements: !78)
!798 = !DIBasicType(name: "float64", size: 64, encoding: DW_ATE_float)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(name: "math._gamQ", linkageName: "math._gamQ", scope: !796, file: !796, line: 75, type: !801, isLocal: false, isDefinition: true, align: 64)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !798, size: 512, align: 64, elements: !71)
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(name: "math._gamS", linkageName: "math._gamS", scope: !796, file: !796, line: 85, type: !804, isLocal: false, isDefinition: true, align: 64)
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !798, size: 320, align: 64, elements: !60)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(name: "math.p0R8", linkageName: "math.p0R8", scope: !807, file: !807, line: 240, type: !808, isLocal: false, isDefinition: true, align: 64)
!807 = !DIFile(filename: "j0.go", directory: "/usr/local/go/src/math")
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !798, size: 384, align: 64, elements: !207)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(name: "math.p0S8", linkageName: "math.p0S8", scope: !807, file: !807, line: 248, type: !804, isLocal: false, isDefinition: true, align: 64)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(name: "math.p0R5", linkageName: "math.p0R5", scope: !807, file: !807, line: 257, type: !808, isLocal: false, isDefinition: true, align: 64)
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(name: "math.p0S5", linkageName: "math.p0S5", scope: !807, file: !807, line: 265, type: !804, isLocal: false, isDefinition: true, align: 64)
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(name: "math.p0R3", linkageName: "math.p0R3", scope: !807, file: !807, line: 274, type: !808, isLocal: false, isDefinition: true, align: 64)
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(name: "math.p0S3", linkageName: "math.p0S3", scope: !807, file: !807, line: 282, type: !804, isLocal: false, isDefinition: true, align: 64)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(name: "math.p0R2", linkageName: "math.p0R2", scope: !807, file: !807, line: 291, type: !808, isLocal: false, isDefinition: true, align: 64)
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(name: "math.p0S2", linkageName: "math.p0S2", scope: !807, file: !807, line: 299, type: !804, isLocal: false, isDefinition: true, align: 64)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(name: "math.q0R8", linkageName: "math.q0R8", scope: !807, file: !807, line: 339, type: !808, isLocal: false, isDefinition: true, align: 64)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(name: "math.q0S8", linkageName: "math.q0S8", scope: !807, file: !807, line: 347, type: !808, isLocal: false, isDefinition: true, align: 64)
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(name: "math.q0R5", linkageName: "math.q0R5", scope: !807, file: !807, line: 357, type: !808, isLocal: false, isDefinition: true, align: 64)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(name: "math.q0S5", linkageName: "math.q0S5", scope: !807, file: !807, line: 365, type: !808, isLocal: false, isDefinition: true, align: 64)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(name: "math.q0R3", linkageName: "math.q0R3", scope: !807, file: !807, line: 375, type: !808, isLocal: false, isDefinition: true, align: 64)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(name: "math.q0S3", linkageName: "math.q0S3", scope: !807, file: !807, line: 383, type: !808, isLocal: false, isDefinition: true, align: 64)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(name: "math.q0R2", linkageName: "math.q0R2", scope: !807, file: !807, line: 393, type: !808, isLocal: false, isDefinition: true, align: 64)
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(name: "math.q0S2", linkageName: "math.q0S2", scope: !807, file: !807, line: 401, type: !808, isLocal: false, isDefinition: true, align: 64)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(name: "math.p1R8", linkageName: "math.p1R8", scope: !841, file: !841, line: 235, type: !808, isLocal: false, isDefinition: true, align: 64)
!841 = !DIFile(filename: "j1.go", directory: "/usr/local/go/src/math")
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(name: "math.p1S8", linkageName: "math.p1S8", scope: !841, file: !841, line: 243, type: !804, isLocal: false, isDefinition: true, align: 64)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(name: "math.p1R5", linkageName: "math.p1R5", scope: !841, file: !841, line: 252, type: !808, isLocal: false, isDefinition: true, align: 64)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(name: "math.p1S5", linkageName: "math.p1S5", scope: !841, file: !841, line: 260, type: !804, isLocal: false, isDefinition: true, align: 64)
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(name: "math.p1R3", linkageName: "math.p1R3", scope: !841, file: !841, line: 269, type: !808, isLocal: false, isDefinition: true, align: 64)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(name: "math.p1S3", linkageName: "math.p1S3", scope: !841, file: !841, line: 277, type: !804, isLocal: false, isDefinition: true, align: 64)
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(name: "math.p1R2", linkageName: "math.p1R2", scope: !841, file: !841, line: 286, type: !808, isLocal: false, isDefinition: true, align: 64)
!854 = !DIGlobalVariableExpression(var: !855, expr: !DIExpression())
!855 = distinct !DIGlobalVariable(name: "math.p1S2", linkageName: "math.p1S2", scope: !841, file: !841, line: 294, type: !804, isLocal: false, isDefinition: true, align: 64)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(name: "math.q1R8", linkageName: "math.q1R8", scope: !841, file: !841, line: 334, type: !808, isLocal: false, isDefinition: true, align: 64)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(name: "math.q1S8", linkageName: "math.q1S8", scope: !841, file: !841, line: 342, type: !808, isLocal: false, isDefinition: true, align: 64)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(name: "math.q1R5", linkageName: "math.q1R5", scope: !841, file: !841, line: 352, type: !808, isLocal: false, isDefinition: true, align: 64)
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(name: "math.q1S5", linkageName: "math.q1S5", scope: !841, file: !841, line: 360, type: !808, isLocal: false, isDefinition: true, align: 64)
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(name: "math.q1R3", linkageName: "math.q1R3", scope: !841, file: !841, line: 370, type: !808, isLocal: false, isDefinition: true, align: 64)
!866 = !DIGlobalVariableExpression(var: !867, expr: !DIExpression())
!867 = distinct !DIGlobalVariable(name: "math.q1S3", linkageName: "math.q1S3", scope: !841, file: !841, line: 378, type: !808, isLocal: false, isDefinition: true, align: 64)
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(name: "math.q1R2", linkageName: "math.q1R2", scope: !841, file: !841, line: 388, type: !808, isLocal: false, isDefinition: true, align: 64)
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(name: "math.q1S2", linkageName: "math.q1S2", scope: !841, file: !841, line: 396, type: !808, isLocal: false, isDefinition: true, align: 64)
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(name: "math._lgamA", linkageName: "math._lgamA", scope: !874, file: !874, line: 91, type: !875, isLocal: false, isDefinition: true, align: 64)
!874 = !DIFile(filename: "lgamma.go", directory: "/usr/local/go/src/math")
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !798, size: 768, align: 64, elements: !300)
!876 = !DIGlobalVariableExpression(var: !877, expr: !DIExpression())
!877 = distinct !DIGlobalVariable(name: "math._lgamR", linkageName: "math._lgamR", scope: !874, file: !874, line: 105, type: !797, isLocal: false, isDefinition: true, align: 64)
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(name: "math._lgamS", linkageName: "math._lgamS", scope: !874, file: !874, line: 114, type: !797, isLocal: false, isDefinition: true, align: 64)
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(name: "math._lgamT", linkageName: "math._lgamT", scope: !874, file: !874, line: 123, type: !882, isLocal: false, isDefinition: true, align: 64)
!882 = !DICompositeType(tag: DW_TAG_array_type, baseType: !798, size: 960, align: 64, elements: !5)
!883 = !DIGlobalVariableExpression(var: !884, expr: !DIExpression())
!884 = distinct !DIGlobalVariable(name: "math._lgamU", linkageName: "math._lgamU", scope: !874, file: !874, line: 140, type: !808, isLocal: false, isDefinition: true, align: 64)
!885 = !DIGlobalVariableExpression(var: !886, expr: !DIExpression())
!886 = distinct !DIGlobalVariable(name: "math._lgamV", linkageName: "math._lgamV", scope: !874, file: !874, line: 148, type: !808, isLocal: false, isDefinition: true, align: 64)
!887 = !DIGlobalVariableExpression(var: !888, expr: !DIExpression())
!888 = distinct !DIGlobalVariable(name: "math._lgamW", linkageName: "math._lgamW", scope: !874, file: !874, line: 156, type: !797, isLocal: false, isDefinition: true, align: 64)
!889 = !DIGlobalVariableExpression(var: !890, expr: !DIExpression())
!890 = distinct !DIGlobalVariable(name: "math.pow10tab", linkageName: "math.pow10tab", scope: !891, file: !891, line: 8, type: !892, isLocal: false, isDefinition: true, align: 64)
!891 = !DIFile(filename: "pow10.go", directory: "/usr/local/go/src/math")
!892 = !DICompositeType(tag: DW_TAG_array_type, baseType: !798, size: 2048, align: 64, elements: !698)
!893 = !DIGlobalVariableExpression(var: !894, expr: !DIExpression())
!894 = distinct !DIGlobalVariable(name: "math.pow10postab32", linkageName: "math.pow10postab32", scope: !891, file: !891, line: 16, type: !895, isLocal: false, isDefinition: true, align: 64)
!895 = !DICompositeType(tag: DW_TAG_array_type, baseType: !798, size: 640, align: 64, elements: !227)
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(name: "math.pow10negtab32", linkageName: "math.pow10negtab32", scope: !891, file: !891, line: 21, type: !898, isLocal: false, isDefinition: true, align: 64)
!898 = !DICompositeType(tag: DW_TAG_array_type, baseType: !798, size: 704, align: 64, elements: !899)
!899 = !{!900}
!900 = !DISubrange(count: 11, lowerBound: 0)
!901 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression())
!902 = distinct !DIGlobalVariable(name: "math._sin", linkageName: "math._sin", scope: !903, file: !903, line: 93, type: !808, isLocal: false, isDefinition: true, align: 64)
!903 = !DIFile(filename: "sin.go", directory: "/usr/local/go/src/math")
!904 = !DIGlobalVariableExpression(var: !905, expr: !DIExpression())
!905 = distinct !DIGlobalVariable(name: "math._cos", linkageName: "math._cos", scope: !903, file: !903, line: 103, type: !808, isLocal: false, isDefinition: true, align: 64)
!906 = !DIGlobalVariableExpression(var: !907, expr: !DIExpression())
!907 = distinct !DIGlobalVariable(name: "math._tanP", linkageName: "math._tanP", scope: !908, file: !908, line: 63, type: !909, isLocal: false, isDefinition: true, align: 64)
!908 = !DIFile(filename: "tan.go", directory: "/usr/local/go/src/math")
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !798, size: 192, align: 64, elements: !53)
!910 = !DIGlobalVariableExpression(var: !911, expr: !DIExpression())
!911 = distinct !DIGlobalVariable(name: "math._tanQ", linkageName: "math._tanQ", scope: !908, file: !908, line: 68, type: !804, isLocal: false, isDefinition: true, align: 64)
!912 = !DIGlobalVariableExpression(var: !913, expr: !DIExpression())
!913 = distinct !DIGlobalVariable(name: "math.tanhP", linkageName: "math.tanhP", scope: !914, file: !914, line: 57, type: !909, isLocal: false, isDefinition: true, align: 64)
!914 = !DIFile(filename: "tanh.go", directory: "/usr/local/go/src/math")
!915 = !DIGlobalVariableExpression(var: !916, expr: !DIExpression())
!916 = distinct !DIGlobalVariable(name: "math.tanhQ", linkageName: "math.tanhQ", scope: !914, file: !914, line: 62, type: !909, isLocal: false, isDefinition: true, align: 64)
!917 = !DIGlobalVariableExpression(var: !918, expr: !DIExpression())
!918 = distinct !DIGlobalVariable(name: "math.mPi4", linkageName: "math.mPi4", scope: !919, file: !919, line: 81, type: !920, isLocal: false, isDefinition: true, align: 64)
!919 = !DIFile(filename: "trig_reduce.go", directory: "/usr/local/go/src/math")
!920 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, size: 1280, align: 64, elements: !392)
!921 = !DIGlobalVariableExpression(var: !922, expr: !DIExpression())
!922 = distinct !DIGlobalVariable(scope: null, file: !923, line: 1, type: !3, isLocal: true, isDefinition: true)
!923 = !DIFile(filename: "exp2_noasm.go", directory: "/usr/local/go/src/math")
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression())
!925 = distinct !DIGlobalVariable(name: "type *string", scope: !84, file: !84, line: 1, type: !93, isLocal: false, isDefinition: true, align: 64)
!926 = !DIGlobalVariableExpression(var: !927, expr: !DIExpression())
!927 = distinct !DIGlobalVariable(name: "type string", scope: !84, file: !84, line: 1, type: !85, isLocal: false, isDefinition: true, align: 64)
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!930 = !DIGlobalVariableExpression(var: !931, expr: !DIExpression())
!931 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression())
!933 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!936 = !DIGlobalVariableExpression(var: !937, expr: !DIExpression())
!937 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!940 = !DIGlobalVariableExpression(var: !941, expr: !DIExpression())
!941 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!950 = !DIGlobalVariableExpression(var: !951, expr: !DIExpression())
!951 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!952 = !DIGlobalVariableExpression(var: !953, expr: !DIExpression())
!953 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!954 = !DIGlobalVariableExpression(var: !955, expr: !DIExpression())
!955 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!956 = !DIGlobalVariableExpression(var: !957, expr: !DIExpression())
!957 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!960 = !DIGlobalVariableExpression(var: !961, expr: !DIExpression())
!961 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!964 = !DIGlobalVariableExpression(var: !965, expr: !DIExpression())
!965 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!968 = !DIGlobalVariableExpression(var: !969, expr: !DIExpression())
!969 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!970 = !DIGlobalVariableExpression(var: !971, expr: !DIExpression())
!971 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!976 = distinct !DICompileUnit(language: DW_LANG_C99, file: !520, producer: "TinyGo", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !977)
!977 = !{!978, !984, !986, !988, !993, !995, !1000, !1005, !1010, !1015}
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(scope: null, file: !980, line: 1, type: !981, isLocal: true, isDefinition: true)
!980 = !DIFile(filename: "value.go", directory: "/usr/local/go/src/sync/atomic")
!981 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 424, align: 8, elements: !982)
!982 = !{!983}
!983 = !DISubrange(count: 53, lowerBound: 0)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(name: "type *string", scope: !84, file: !84, line: 1, type: !93, isLocal: false, isDefinition: true, align: 64)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(name: "type string", scope: !84, file: !84, line: 1, type: !85, isLocal: false, isDefinition: true, align: 64)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(scope: null, file: !980, line: 1, type: !990, isLocal: true, isDefinition: true)
!990 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, align: 8, elements: !991)
!991 = !{!992}
!992 = !DISubrange(count: 60, lowerBound: 0)
!993 = !DIGlobalVariableExpression(var: !994, expr: !DIExpression())
!994 = distinct !DIGlobalVariable(name: "sync/atomic.firstStoreInProgress", linkageName: "sync/atomic.firstStoreInProgress", scope: !980, file: !980, line: 42, type: !536, isLocal: false, isDefinition: true, align: 8)
!995 = !DIGlobalVariableExpression(var: !996, expr: !DIExpression())
!996 = distinct !DIGlobalVariable(scope: null, file: !980, line: 1, type: !997, isLocal: true, isDefinition: true)
!997 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 560, align: 8, elements: !998)
!998 = !{!999}
!999 = !DISubrange(count: 70, lowerBound: 0)
!1000 = !DIGlobalVariableExpression(var: !1001, expr: !DIExpression())
!1001 = distinct !DIGlobalVariable(scope: null, file: !980, line: 1, type: !1002, isLocal: true, isDefinition: true)
!1002 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, align: 8, elements: !1003)
!1003 = !{!1004}
!1004 = !DISubrange(count: 42, lowerBound: 0)
!1005 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression())
!1006 = distinct !DIGlobalVariable(scope: null, file: !980, line: 1, type: !1007, isLocal: true, isDefinition: true)
!1007 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 472, align: 8, elements: !1008)
!1008 = !{!1009}
!1009 = !DISubrange(count: 59, lowerBound: 0)
!1010 = !DIGlobalVariableExpression(var: !1011, expr: !DIExpression())
!1011 = distinct !DIGlobalVariable(scope: null, file: !980, line: 1, type: !1012, isLocal: true, isDefinition: true)
!1012 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, align: 8, elements: !1013)
!1013 = !{!1014}
!1014 = !DISubrange(count: 41, lowerBound: 0)
!1015 = !DIGlobalVariableExpression(var: !1016, expr: !DIExpression())
!1016 = distinct !DIGlobalVariable(scope: null, file: !980, line: 1, type: !1017, isLocal: true, isDefinition: true)
!1017 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 464, align: 8, elements: !1018)
!1018 = !{!1019}
!1019 = !DISubrange(count: 58, lowerBound: 0)
!1020 = distinct !DICompileUnit(language: DW_LANG_C99, file: !520, producer: "TinyGo", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!1021 = distinct !DICompileUnit(language: DW_LANG_C99, file: !520, producer: "TinyGo", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!1022 = distinct !DICompileUnit(language: DW_LANG_C99, file: !520, producer: "TinyGo", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1023)
