; ModuleID = 'main'
source_filename = "main"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-musleabihf"

%runtime._string = type { ptr, i64 }
%"unicode/utf8.acceptRange" = type { i8, i8 }
%"internal/task.Task" = type { ptr, ptr, i64, %"sync/atomic.noCopy", %"internal/task.state", i8, i1, i8, ptr }
%"sync/atomic.noCopy" = type {}
%"internal/task.state" = type { i64, ptr, i64, i64, ptr, %"internal/task.Semaphore" }
%"internal/task.Semaphore" = type { %"internal/futex.Futex" }
%"internal/futex.Futex" = type { %"sync/atomic.Bool" }
%"sync/atomic.Bool" = type { %"sync/atomic.noCopy", i32 }
%runtime.elfHeader = type { i32, i8, i8, i8, i8, i8, [7 x i8], i16, i16, i32, i64, i64, i64, i32, i16, i16, i16, i16, i16, i16 }
%"internal/reflectlite.RawType" = type { i8 }
%"internal/reflectlite.ptrType" = type { %"internal/reflectlite.RawType", i16, ptr, %"internal/reflectlite.methodSet" }
%"internal/reflectlite.methodSet" = type { i64, [0 x ptr] }
%"internal/reflectlite.elemType" = type { %"internal/reflectlite.RawType", i16, ptr, ptr }
%"internal/reflectlite.arrayType" = type { %"internal/reflectlite.RawType", i16, ptr, ptr, i64, ptr }
%"internal/reflectlite.structType" = type { %"internal/reflectlite.RawType", i16, ptr, ptr, i32, i16, [1 x { ptr, ptr }] }
%"internal/reflectlite.rawStructField" = type { %runtime._string, %runtime._string, ptr, %runtime._string, i64, i1 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "stubs.go", directory: "/usr/local/go/src/math")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, align: 8, elements: !5)
!4 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!5 = !{!6}
!6 = !DISubrange(count: 15, lowerBound: 0)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(scope: null, file: !11, line: 12, type: !12, isLocal: true, isDefinition: true)
!11 = !DIFile(filename: "itoa.go", directory: "/usr/local/lib/tinygo/src/internal/itoa")
!12 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, align: 8, elements: !13)
!13 = !{!14}
!14 = !DISubrange(count: 1, lowerBound: 0)
!15 = !DIGlobalVariableExpression(var: !16, expr: !DIExpression())
!16 = distinct !DIGlobalVariable(scope: null, file: !11, line: 20, type: !12, isLocal: true, isDefinition: true)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "unicode/utf8.first", linkageName: "unicode/utf8.first", scope: !19, file: !19, line: 71, type: !20, isLocal: false, isDefinition: true, align: 8)
!19 = !DIFile(filename: "utf8.go", directory: "/usr/local/lib/tinygo/src/unicode/utf8")
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, align: 8, elements: !21)
!21 = !{!22}
!22 = !DISubrange(count: 256, lowerBound: 0)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "unicode/utf8.acceptRanges", linkageName: "unicode/utf8.acceptRanges", scope: !19, file: !19, line: 100, type: !25, isLocal: false, isDefinition: true, align: 8)
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 256, align: 8, elements: !31)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "unicode/utf8.acceptRange", baseType: !27)
!27 = !DICompositeType(tag: DW_TAG_structure_type, size: 16, align: 8, elements: !28)
!28 = !{!29, !30}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "lo", baseType: !4, size: 8, align: 8)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "hi", baseType: !4, size: 8, align: 8, offset: 8)
!31 = !{!32}
!32 = !DISubrange(count: 16, lowerBound: 0)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(scope: null, file: !35, line: 393, type: !36, isLocal: true, isDefinition: true)
!35 = !DIFile(filename: "type.go", directory: "/usr/local/lib/tinygo/src/internal/reflectlite")
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, align: 8, elements: !37)
!37 = !{!38}
!38 = !DISubrange(count: 4, lowerBound: 0)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "internal/reflectlite.errTypeElem", linkageName: "internal/reflectlite.errTypeElem", scope: !35, file: !35, line: 393, type: !41, isLocal: false, isDefinition: true, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "internal/reflectlite.TypeError", baseType: !43)
!43 = !DICompositeType(tag: DW_TAG_structure_type, size: 128, align: 64, elements: !44)
!44 = !{!45}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "Method", baseType: !46, size: 128, align: 64)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", size: 128, align: 64, elements: !47)
!47 = !{!48, !50}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64, dwarfAddressSpace: 0)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "len", baseType: !51, size: 64, align: 64, offset: 64)
!51 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(scope: null, file: !35, line: 394, type: !54, isLocal: true, isDefinition: true)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, align: 8, elements: !55)
!55 = !{!56}
!56 = !DISubrange(count: 3, lowerBound: 0)
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "internal/reflectlite.errTypeKey", linkageName: "internal/reflectlite.errTypeKey", scope: !35, file: !35, line: 394, type: !41, isLocal: false, isDefinition: true, align: 64)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(scope: null, file: !35, line: 395, type: !61, isLocal: true, isDefinition: true)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, align: 8, elements: !62)
!62 = !{!63}
!63 = !DISubrange(count: 5, lowerBound: 0)
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(name: "internal/reflectlite.errTypeField", linkageName: "internal/reflectlite.errTypeField", scope: !35, file: !35, line: 395, type: !41, isLocal: false, isDefinition: true, align: 64)
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(scope: null, file: !35, line: 397, type: !54, isLocal: true, isDefinition: true)
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(name: "internal/reflectlite.errTypeLen", linkageName: "internal/reflectlite.errTypeLen", scope: !35, file: !35, line: 397, type: !41, isLocal: false, isDefinition: true, align: 64)
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(scope: null, file: !35, line: 398, type: !72, isLocal: true, isDefinition: true)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, align: 8, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: 8, lowerBound: 0)
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "internal/reflectlite.errTypeNumField", linkageName: "internal/reflectlite.errTypeNumField", scope: !35, file: !35, line: 398, type: !41, isLocal: false, isDefinition: true, align: 64)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(scope: null, file: !35, line: 399, type: !79, isLocal: true, isDefinition: true)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, align: 8, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 7, lowerBound: 0)
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(name: "internal/reflectlite.errTypeChanDir", linkageName: "internal/reflectlite.errTypeChanDir", scope: !35, file: !35, line: 399, type: !41, isLocal: false, isDefinition: true, align: 64)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(name: "type uint8", scope: !86, file: !86, line: 1, type: !87, isLocal: false, isDefinition: true, align: 64)
!86 = !DIFile(filename: "<Go type>", directory: "")
!87 = !DICompositeType(tag: DW_TAG_structure_type, size: 128, align: 64, elements: !88)
!88 = !{!89, !91}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "kind", baseType: !90, size: 8, align: 8)
!90 = !DIBasicType(name: "int8", size: 8, encoding: DW_ATE_signed)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "ptrTo", baseType: !92, size: 64, align: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe.Pointer", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(name: "type *uint8", scope: !86, file: !86, line: 1, type: !95, isLocal: false, isDefinition: true, align: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, size: 128, align: 64, elements: !96)
!96 = !{!89, !97, !99}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "numMethods", baseType: !98, size: 16, align: 16, offset: 16)
!98 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "elementType", baseType: !92, size: 64, align: 64, offset: 64)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(name: "type struct{meta uint8}", scope: !86, file: !86, line: 1, type: !102, isLocal: false, isDefinition: true, align: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, size: 384, align: 64, elements: !103)
!103 = !{!89, !97, !91, !104, !105, !107, !108}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "pkgpath", baseType: !92, size: 64, align: 64, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "size", baseType: !106, size: 32, align: 32, offset: 192)
!106 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "numFields", baseType: !98, size: 16, align: 16, offset: 224)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "fields", baseType: !109, size: 128, align: 64, offset: 256)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 128, align: 64, elements: !13)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "runtime.structField", baseType: !111)
!111 = !DICompositeType(tag: DW_TAG_structure_type, size: 128, align: 64, elements: !112)
!112 = !{!113, !114}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", baseType: !92, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "data", baseType: !49, size: 64, align: 64, offset: 64)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "type *struct{meta uint8}", scope: !86, file: !86, line: 1, type: !95, isLocal: false, isDefinition: true, align: 64)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(scope: null, file: !119, line: 17, type: !120, isLocal: true, isDefinition: true)
!119 = !DIFile(filename: "strconv.go", directory: "/usr/local/lib/tinygo/src/internal/reflectlite")
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, align: 8, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 14, lowerBound: 0)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "type struct{}", scope: !86, file: !86, line: 1, type: !125, isLocal: false, isDefinition: true, align: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, size: 256, align: 64, elements: !126)
!126 = !{!89, !97, !91, !104, !105, !107, !127}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "fields", baseType: !128, align: 64, offset: 256)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, align: 64, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 0, lowerBound: 0)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "type *struct{}", scope: !86, file: !86, line: 1, type: !95, isLocal: false, isDefinition: true, align: 64)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(scope: null, file: !119, line: 250, type: !135, isLocal: true, isDefinition: true)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, align: 8, elements: !136)
!136 = !{!137}
!137 = !DISubrange(count: 2, lowerBound: 0)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(scope: null, file: !119, line: 251, type: !3, isLocal: true, isDefinition: true)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(scope: null, file: !119, line: 252, type: !3, isLocal: true, isDefinition: true)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(scope: null, file: !119, line: 278, type: !135, isLocal: true, isDefinition: true)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(scope: null, file: !119, line: 280, type: !135, isLocal: true, isDefinition: true)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(scope: null, file: !119, line: 282, type: !135, isLocal: true, isDefinition: true)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(scope: null, file: !119, line: 284, type: !135, isLocal: true, isDefinition: true)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(scope: null, file: !119, line: 286, type: !135, isLocal: true, isDefinition: true)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(scope: null, file: !119, line: 288, type: !135, isLocal: true, isDefinition: true)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(scope: null, file: !119, line: 290, type: !135, isLocal: true, isDefinition: true)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(scope: null, file: !119, line: 294, type: !135, isLocal: true, isDefinition: true)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(scope: null, file: !119, line: 295, type: !3, isLocal: true, isDefinition: true)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(scope: null, file: !119, line: 296, type: !3, isLocal: true, isDefinition: true)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(scope: null, file: !119, line: 301, type: !135, isLocal: true, isDefinition: true)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(scope: null, file: !119, line: 303, type: !3, isLocal: true, isDefinition: true)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(scope: null, file: !119, line: 306, type: !135, isLocal: true, isDefinition: true)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(scope: null, file: !119, line: 308, type: !3, isLocal: true, isDefinition: true)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "type internal/reflectlite.ValueError", scope: !86, file: !86, line: 1, type: !172, isLocal: false, isDefinition: true, align: 64)
!172 = !DICompositeType(tag: DW_TAG_structure_type, size: 448, align: 64, elements: !173)
!173 = !{!89, !97, !91, !174, !175, !176}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "underlying", baseType: !92, size: 64, align: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "pkgpath", baseType: !92, size: 64, align: 64, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "name", baseType: !177, size: 184, align: 8, offset: 256)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 184, align: 8, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 23, lowerBound: 0)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "type struct{Method string; Kind internal/reflectlite.Kind}", scope: !86, file: !86, line: 1, type: !182, isLocal: false, isDefinition: true, align: 64)
!182 = !DICompositeType(tag: DW_TAG_structure_type, size: 512, align: 64, elements: !183)
!183 = !{!89, !97, !91, !104, !105, !107, !184}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "fields", baseType: !185, size: 256, align: 64, offset: 256)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 256, align: 64, elements: !136)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "type *struct{Method string; Kind internal/reflectlite.Kind}", scope: !86, file: !86, line: 1, type: !95, isLocal: false, isDefinition: true, align: 64)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(scope: null, file: !35, line: 60, type: !79, isLocal: true, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(scope: null, file: !35, line: 62, type: !36, isLocal: true, isDefinition: true)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(scope: null, file: !35, line: 64, type: !54, isLocal: true, isDefinition: true)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(scope: null, file: !35, line: 66, type: !36, isLocal: true, isDefinition: true)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(scope: null, file: !35, line: 68, type: !61, isLocal: true, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(scope: null, file: !35, line: 70, type: !61, isLocal: true, isDefinition: true)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(scope: null, file: !35, line: 72, type: !61, isLocal: true, isDefinition: true)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(scope: null, file: !35, line: 74, type: !36, isLocal: true, isDefinition: true)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(scope: null, file: !35, line: 76, type: !61, isLocal: true, isDefinition: true)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(scope: null, file: !35, line: 78, type: !208, isLocal: true, isDefinition: true)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, align: 8, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 6, lowerBound: 0)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(scope: null, file: !35, line: 80, type: !208, isLocal: true, isDefinition: true)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(scope: null, file: !35, line: 82, type: !208, isLocal: true, isDefinition: true)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(scope: null, file: !35, line: 84, type: !79, isLocal: true, isDefinition: true)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(scope: null, file: !35, line: 86, type: !79, isLocal: true, isDefinition: true)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(scope: null, file: !35, line: 88, type: !79, isLocal: true, isDefinition: true)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(scope: null, file: !35, line: 90, type: !223, isLocal: true, isDefinition: true)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, align: 8, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 9, lowerBound: 0)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(scope: null, file: !35, line: 92, type: !228, isLocal: true, isDefinition: true)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, align: 8, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 10, lowerBound: 0)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(scope: null, file: !35, line: 94, type: !208, isLocal: true, isDefinition: true)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(scope: null, file: !35, line: 96, type: !120, isLocal: true, isDefinition: true)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(scope: null, file: !35, line: 98, type: !36, isLocal: true, isDefinition: true)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(scope: null, file: !35, line: 100, type: !223, isLocal: true, isDefinition: true)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(scope: null, file: !35, line: 102, type: !54, isLocal: true, isDefinition: true)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(scope: null, file: !35, line: 104, type: !61, isLocal: true, isDefinition: true)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(scope: null, file: !35, line: 106, type: !61, isLocal: true, isDefinition: true)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(scope: null, file: !35, line: 108, type: !36, isLocal: true, isDefinition: true)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(scope: null, file: !35, line: 110, type: !54, isLocal: true, isDefinition: true)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(scope: null, file: !35, line: 112, type: !208, isLocal: true, isDefinition: true)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(scope: null, file: !35, line: 114, type: !36, isLocal: true, isDefinition: true)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "type internal/reflectlite.TypeError", scope: !86, file: !86, line: 1, type: !255, isLocal: false, isDefinition: true, align: 64)
!255 = !DICompositeType(tag: DW_TAG_structure_type, size: 448, align: 64, elements: !256)
!256 = !{!89, !97, !91, !174, !175, !257}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "name", baseType: !258, size: 176, align: 8, offset: 256)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 176, align: 8, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 22, lowerBound: 0)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "type struct{Method string}", scope: !86, file: !86, line: 1, type: !102, isLocal: false, isDefinition: true, align: 64)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "type *struct{Method string}", scope: !86, file: !86, line: 1, type: !95, isLocal: false, isDefinition: true, align: 64)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(scope: null, file: !35, line: 329, type: !79, isLocal: true, isDefinition: true)
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(scope: null, file: !35, line: 331, type: !79, isLocal: true, isDefinition: true)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(scope: null, file: !35, line: 338, type: !208, isLocal: true, isDefinition: true)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(scope: null, file: !35, line: 338, type: !12, isLocal: true, isDefinition: true)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(scope: null, file: !35, line: 340, type: !61, isLocal: true, isDefinition: true)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(scope: null, file: !35, line: 344, type: !12, isLocal: true, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(scope: null, file: !35, line: 346, type: !135, isLocal: true, isDefinition: true)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(scope: null, file: !35, line: 348, type: !12, isLocal: true, isDefinition: true)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(scope: null, file: !35, line: 348, type: !12, isLocal: true, isDefinition: true)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(scope: null, file: !35, line: 350, type: !36, isLocal: true, isDefinition: true)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(scope: null, file: !35, line: 350, type: !12, isLocal: true, isDefinition: true)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(scope: null, file: !35, line: 354, type: !223, isLocal: true, isDefinition: true)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(scope: null, file: !35, line: 359, type: !12, isLocal: true, isDefinition: true)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(scope: null, file: !35, line: 359, type: !12, isLocal: true, isDefinition: true)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(scope: null, file: !35, line: 361, type: !12, isLocal: true, isDefinition: true)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(scope: null, file: !35, line: 365, type: !12, isLocal: true, isDefinition: true)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(scope: null, file: !35, line: 368, type: !135, isLocal: true, isDefinition: true)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(scope: null, file: !35, line: 372, type: !301, isLocal: true, isDefinition: true)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, align: 8, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 12, lowerBound: 0)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(scope: null, file: !35, line: 356, type: !72, isLocal: true, isDefinition: true)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(scope: null, file: !35, line: 1, type: !308, isLocal: true, isDefinition: true)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, align: 8, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 33, lowerBound: 0)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !35, line: 1212, type: !313, isLocal: true, isDefinition: true)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, align: 8, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 30, lowerBound: 0)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(scope: null, file: !35, line: 1212, type: !318, isLocal: true, isDefinition: true)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, align: 8, elements: !31)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(scope: null, file: !321, line: 1791, type: !322, isLocal: true, isDefinition: true)
!321 = !DIFile(filename: "value.go", directory: "/usr/local/lib/tinygo/src/internal/reflectlite")
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, align: 8, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 17, lowerBound: 0)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(scope: null, file: !321, line: 1791, type: !120, isLocal: true, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(scope: null, file: !321, line: 1793, type: !322, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(scope: null, file: !321, line: 1793, type: !36, isLocal: true, isDefinition: true)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(scope: null, file: !321, line: 1793, type: !208, isLocal: true, isDefinition: true)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "internal/task.activeTasks", linkageName: "internal/task.activeTasks", scope: !335, file: !335, line: 45, type: !336, isLocal: false, isDefinition: true, align: 64)
!335 = !DIFile(filename: "task_threads.go", directory: "/usr/local/lib/tinygo/src/internal/task")
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64, align: 64, dwarfAddressSpace: 0)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "internal/task.Task", baseType: !338)
!338 = !DICompositeType(tag: DW_TAG_structure_type, size: 704, align: 64, elements: !339)
!339 = !{!340, !341, !342, !344, !348, !374, !375, !377, !378}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "Next", baseType: !336, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "Ptr", baseType: !92, size: 64, align: 64, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "Data", baseType: !343, size: 64, align: 64, offset: 128)
!343 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "gcData", baseType: !345, align: 8, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "internal/task.gcData", baseType: !346)
!346 = !DICompositeType(tag: DW_TAG_structure_type, align: 8, elements: !347)
!347 = !{}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "state", baseType: !349, size: 384, align: 64, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "internal/task.state", baseType: !350)
!350 = !DICompositeType(tag: DW_TAG_structure_type, size: 384, align: 64, elements: !351)
!351 = !{!352, !353, !355, !356, !357, !358}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "id", baseType: !51, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "thread", baseType: !354, size: 64, align: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "internal/task.threadID", baseType: !92)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "stackTop", baseType: !51, size: 64, align: 64, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "stackBottom", baseType: !51, size: 64, align: 64, offset: 192)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "QueueNext", baseType: !336, size: 64, align: 64, offset: 256)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "pauseSem", baseType: !359, size: 32, align: 32, offset: 320)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "internal/task.Semaphore", baseType: !360)
!360 = !DICompositeType(tag: DW_TAG_structure_type, size: 32, align: 32, elements: !361)
!361 = !{!362}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "futex", baseType: !363, size: 32, align: 32)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "internal/task.Futex", baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "internal/futex.Futex", baseType: !365)
!365 = !DICompositeType(tag: DW_TAG_structure_type, size: 32, align: 32, elements: !366)
!366 = !{!367}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "Uint32", baseType: !368, size: 32, align: 32)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "sync/atomic.Uint32", baseType: !369)
!369 = !DICompositeType(tag: DW_TAG_structure_type, size: 32, align: 32, elements: !370)
!370 = !{!371, !373}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_", baseType: !372, align: 8)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "sync/atomic.noCopy", baseType: !346)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "v", baseType: !106, size: 32, align: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "FipsIndicator", baseType: !4, size: 8, align: 8, offset: 576)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "FipsOnlyBypass", baseType: !376, size: 8, align: 8, offset: 584)
!376 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "RunState", baseType: !4, size: 8, align: 8, offset: 592)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "DeferFrame", baseType: !92, size: 64, align: 64, offset: 640)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "internal/task.mainTask", linkageName: "internal/task.mainTask", scope: !335, file: !335, line: 42, type: !337, isLocal: false, isDefinition: true, align: 64)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(scope: null, file: !383, line: 1, type: !313, isLocal: true, isDefinition: true)
!383 = !DIFile(filename: "mutex-preemptive.go", directory: "/usr/local/lib/tinygo/src/internal/task")
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "internal/task.numCPU", linkageName: "internal/task.numCPU", scope: !335, file: !335, line: 40, type: !386, isLocal: false, isDefinition: true, align: 32)
!386 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "internal/task.activeTaskLock", linkageName: "internal/task.activeTaskLock", scope: !335, file: !335, line: 46, type: !389, isLocal: false, isDefinition: true, align: 32)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "internal/task.PMutex", baseType: !390)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "internal/task.Mutex", baseType: !360)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(scope: null, file: !335, line: 64, type: !393, isLocal: true, isDefinition: true)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, align: 8, elements: !394)
!394 = !{!395}
!395 = !DISubrange(count: 20, lowerBound: 0)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(scope: null, file: !335, line: 77, type: !301, isLocal: true, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "internal/task.otherGoroutines", linkageName: "internal/task.otherGoroutines", scope: !335, file: !335, line: 99, type: !106, isLocal: false, isDefinition: true, align: 32)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(scope: null, file: !335, line: 127, type: !223, isLocal: true, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(scope: null, file: !335, line: 146, type: !322, isLocal: true, isDefinition: true)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "internal/task.scanWaitGroup", linkageName: "internal/task.scanWaitGroup", scope: !335, file: !335, line: 151, type: !406, isLocal: false, isDefinition: true, align: 32)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "internal/task.waitGroup", baseType: !407)
!407 = !DICompositeType(tag: DW_TAG_structure_type, size: 32, align: 32, elements: !408)
!408 = !{!409}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "f", baseType: !363, size: 32, align: 32)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "internal/task.gcState", linkageName: "internal/task.gcState", scope: !335, file: !335, line: 180, type: !363, isLocal: false, isDefinition: true, align: 32)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "runtime.xorshift32State", linkageName: "runtime.xorshift32State", scope: !414, file: !414, line: 32, type: !106, isLocal: false, isDefinition: true, align: 32)
!414 = !DIFile(filename: "algorithm.go", directory: "/usr/local/lib/tinygo/src/runtime")
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "runtime.xorshift64State", linkageName: "runtime.xorshift64State", scope: !414, file: !414, line: 52, type: !343, isLocal: false, isDefinition: true, align: 64)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "runtime.heapSize", linkageName: "runtime.heapSize", scope: !419, file: !419, line: 298, type: !51, isLocal: false, isDefinition: true, align: 64)
!419 = !DIFile(filename: "runtime_unix.go", directory: "/usr/local/lib/tinygo/src/runtime")
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "type string", scope: !86, file: !86, line: 1, type: !87, isLocal: false, isDefinition: true, align: 64)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(name: "type *string", scope: !86, file: !86, line: 1, type: !95, isLocal: false, isDefinition: true, align: 64)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(name: "runtime.zeroSizedAlloc", linkageName: "runtime.zeroSizedAlloc", scope: !426, file: !426, line: 30, type: !4, isLocal: false, isDefinition: true, align: 8)
!426 = !DIFile(filename: "gc_boehm.go", directory: "/usr/local/lib/tinygo/src/runtime")
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(name: "runtime.gcLock", linkageName: "runtime.gcLock", scope: !426, file: !426, line: 32, type: !389, isLocal: false, isDefinition: true, align: 32)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(scope: null, file: !426, line: 93, type: !322, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(scope: null, file: !433, line: 78, type: !79, isLocal: true, isDefinition: true)
!433 = !DIFile(filename: "panic.go", directory: "/usr/local/lib/tinygo/src/runtime")
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(scope: null, file: !433, line: 99, type: !436, isLocal: true, isDefinition: true)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, align: 8, elements: !437)
!437 = !{!438}
!438 = !DISubrange(count: 24, lowerBound: 0)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(scope: null, file: !433, line: 101, type: !135, isLocal: true, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(scope: null, file: !433, line: 103, type: !443, isLocal: true, isDefinition: true)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, align: 8, elements: !259)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(scope: null, file: !433, line: 184, type: !446, isLocal: true, isDefinition: true)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, align: 8, elements: !178)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(scope: null, file: !433, line: 194, type: !449, isLocal: true, isDefinition: true)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, align: 8, elements: !450)
!450 = !{!451}
!451 = !DISubrange(count: 18, lowerBound: 0)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(scope: null, file: !433, line: 199, type: !449, isLocal: true, isDefinition: true)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(scope: null, file: !433, line: 212, type: !456, isLocal: true, isDefinition: true)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, align: 8, elements: !457)
!457 = !{!458}
!458 = !DISubrange(count: 37, lowerBound: 0)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(scope: null, file: !433, line: 222, type: !120, isLocal: true, isDefinition: true)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !463, line: 117, type: !54, isLocal: true, isDefinition: true)
!463 = !DIFile(filename: "print.go", directory: "/usr/local/lib/tinygo/src/runtime")
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(scope: null, file: !463, line: 120, type: !36, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !463, line: 123, type: !36, isLocal: true, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(scope: null, file: !463, line: 197, type: !54, isLocal: true, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !463, line: 200, type: !36, isLocal: true, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(scope: null, file: !463, line: 203, type: !36, isLocal: true, isDefinition: true)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(scope: null, file: !463, line: 272, type: !135, isLocal: true, isDefinition: true)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(scope: null, file: !463, line: 279, type: !135, isLocal: true, isDefinition: true)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(scope: null, file: !463, line: 373, type: !54, isLocal: true, isDefinition: true)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(scope: null, file: !463, line: 391, type: !36, isLocal: true, isDefinition: true)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(scope: null, file: !463, line: 393, type: !61, isLocal: true, isDefinition: true)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(name: "runtime.stackTop", linkageName: "runtime.stackTop", scope: !419, file: !419, line: 75, type: !51, isLocal: false, isDefinition: true, align: 64)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(name: "runtime.main_argc", linkageName: "runtime.main_argc", scope: !419, file: !419, line: 105, type: !386, isLocal: false, isDefinition: true, align: 32)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(name: "runtime.main_argv", linkageName: "runtime.main_argv", scope: !419, file: !419, line: 106, type: !490, isLocal: false, isDefinition: true, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64, dwarfAddressSpace: 0)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(scope: null, file: !419, line: 155, type: !436, isLocal: true, isDefinition: true)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(scope: null, file: !419, line: 160, type: !318, isLocal: true, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(scope: null, file: !419, line: 163, type: !208, isLocal: true, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(scope: null, file: !419, line: 165, type: !208, isLocal: true, isDefinition: true)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(scope: null, file: !419, line: 167, type: !79, isLocal: true, isDefinition: true)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(scope: null, file: !419, line: 158, type: !393, isLocal: true, isDefinition: true)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(name: "runtime.signalFutex", linkageName: "runtime.signalFutex", scope: !419, file: !419, line: 354, type: !364, isLocal: false, isDefinition: true, align: 32)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(name: "runtime.heapMaxSize", linkageName: "runtime.heapMaxSize", scope: !419, file: !419, line: 299, type: !51, isLocal: false, isDefinition: true, align: 64)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "runtime.heapStart", linkageName: "runtime.heapStart", scope: !419, file: !419, line: 301, type: !51, isLocal: false, isDefinition: true, align: 64)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "runtime.heapEnd", linkageName: "runtime.heapEnd", scope: !419, file: !419, line: 301, type: !51, isLocal: false, isDefinition: true, align: 64)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(scope: null, file: !419, line: 317, type: !513, isLocal: true, isDefinition: true)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, align: 8, elements: !514)
!514 = !{!515}
!515 = !DISubrange(count: 27, lowerBound: 0)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "runtime.receivedSignals", linkageName: "runtime.receivedSignals", scope: !419, file: !419, line: 358, type: !368, isLocal: false, isDefinition: true, align: 32)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "runtime.printLock", linkageName: "runtime.printLock", scope: !520, file: !520, line: 136, type: !390, isLocal: false, isDefinition: true, align: 32)
!520 = !DIFile(filename: "scheduler_threads.go", directory: "/usr/local/lib/tinygo/src/runtime")
!521 = distinct !DICompileUnit(language: DW_LANG_C99, file: !522, producer: "TinyGo", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!522 = !DIFile(filename: "<unknown>", directory: "")
!523 = distinct !DICompileUnit(language: DW_LANG_C99, file: !522, producer: "TinyGo", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !524)
!524 = !{!525, !528, !577, !585, !600, !610, !616, !625, !651, !658, !664, !679, !681, !683, !685, !687, !689, !691, !693, !695, !697, !702, !704, !709, !711, !714, !716, !718, !720, !722, !724, !726, !728, !730, !732, !734, !736, !738, !740, !742, !744, !746, !748, !750, !752, !754, !756, !758, !760, !422, !420, !766}
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(name: "internal/cpu.CacheLineSize", linkageName: "internal/cpu.CacheLineSize", scope: !527, file: !527, line: 17, type: !51, isLocal: false, isDefinition: true, align: 64)
!527 = !DIFile(filename: "cpu.go", directory: "/usr/local/go/src/internal/cpu")
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "internal/cpu.X86", linkageName: "internal/cpu.X86", scope: !527, file: !527, line: 23, type: !530, isLocal: false, isDefinition: true, align: 8)
!530 = !DICompositeType(tag: DW_TAG_structure_type, size: 1304, align: 8, elements: !531)
!531 = !{!532, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_", baseType: !533, size: 512, align: 8)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "internal/cpu.CacheLinePad", baseType: !534)
!534 = !DICompositeType(tag: DW_TAG_structure_type, size: 512, align: 8, elements: !535)
!535 = !{!536}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_", baseType: !537, size: 512, align: 8)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !538, size: 512, align: 8, elements: !539)
!538 = !DIBasicType(name: "byte", size: 8, encoding: DW_ATE_unsigned)
!539 = !{!540}
!540 = !DISubrange(count: 64, lowerBound: 0)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "HasAES", baseType: !376, size: 8, align: 8, offset: 512)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "HasADX", baseType: !376, size: 8, align: 8, offset: 520)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX", baseType: !376, size: 8, align: 8, offset: 528)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVXVNNI", baseType: !376, size: 8, align: 8, offset: 536)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX2", baseType: !376, size: 8, align: 8, offset: 544)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512", baseType: !376, size: 8, align: 8, offset: 552)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512F", baseType: !376, size: 8, align: 8, offset: 560)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512CD", baseType: !376, size: 8, align: 8, offset: 568)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512BW", baseType: !376, size: 8, align: 8, offset: 576)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512DQ", baseType: !376, size: 8, align: 8, offset: 584)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512VL", baseType: !376, size: 8, align: 8, offset: 592)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512GFNI", baseType: !376, size: 8, align: 8, offset: 600)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512VAES", baseType: !376, size: 8, align: 8, offset: 608)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512VNNI", baseType: !376, size: 8, align: 8, offset: 616)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512VBMI", baseType: !376, size: 8, align: 8, offset: 624)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512VBMI2", baseType: !376, size: 8, align: 8, offset: 632)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512BITALG", baseType: !376, size: 8, align: 8, offset: 640)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512VPOPCNTDQ", baseType: !376, size: 8, align: 8, offset: 648)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "HasAVX512VPCLMULQDQ", baseType: !376, size: 8, align: 8, offset: 656)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "HasBMI1", baseType: !376, size: 8, align: 8, offset: 664)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "HasBMI2", baseType: !376, size: 8, align: 8, offset: 672)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "HasERMS", baseType: !376, size: 8, align: 8, offset: 680)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "HasFSRM", baseType: !376, size: 8, align: 8, offset: 688)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "HasFMA", baseType: !376, size: 8, align: 8, offset: 696)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "HasGFNI", baseType: !376, size: 8, align: 8, offset: 704)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "HasOSXSAVE", baseType: !376, size: 8, align: 8, offset: 712)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "HasPCLMULQDQ", baseType: !376, size: 8, align: 8, offset: 720)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "HasPOPCNT", baseType: !376, size: 8, align: 8, offset: 728)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "HasRDTSCP", baseType: !376, size: 8, align: 8, offset: 736)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "HasSHA", baseType: !376, size: 8, align: 8, offset: 744)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "HasSSE3", baseType: !376, size: 8, align: 8, offset: 752)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "HasSSSE3", baseType: !376, size: 8, align: 8, offset: 760)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "HasSSE41", baseType: !376, size: 8, align: 8, offset: 768)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "HasSSE42", baseType: !376, size: 8, align: 8, offset: 776)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "HasVAES", baseType: !376, size: 8, align: 8, offset: 784)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_", baseType: !533, size: 512, align: 8, offset: 792)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(name: "internal/cpu.ARM", linkageName: "internal/cpu.ARM", scope: !527, file: !527, line: 65, type: !579, isLocal: false, isDefinition: true, align: 8)
!579 = !DICompositeType(tag: DW_TAG_structure_type, size: 1048, align: 8, elements: !580)
!580 = !{!532, !581, !582, !583, !584}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "HasVFPv4", baseType: !376, size: 8, align: 8, offset: 512)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "HasIDIVA", baseType: !376, size: 8, align: 8, offset: 520)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "HasV7Atomics", baseType: !376, size: 8, align: 8, offset: 528)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_", baseType: !533, size: 512, align: 8, offset: 536)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(name: "internal/cpu.ARM64", linkageName: "internal/cpu.ARM64", scope: !527, file: !527, line: 75, type: !587, isLocal: false, isDefinition: true, align: 8)
!587 = !DICompositeType(tag: DW_TAG_structure_type, size: 1112, align: 8, elements: !588)
!588 = !{!532, !541, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "HasPMULL", baseType: !376, size: 8, align: 8, offset: 520)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "HasSHA1", baseType: !376, size: 8, align: 8, offset: 528)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "HasSHA2", baseType: !376, size: 8, align: 8, offset: 536)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "HasSHA512", baseType: !376, size: 8, align: 8, offset: 544)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "HasSHA3", baseType: !376, size: 8, align: 8, offset: 552)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "HasCRC32", baseType: !376, size: 8, align: 8, offset: 560)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "HasATOMICS", baseType: !376, size: 8, align: 8, offset: 568)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "HasCPUID", baseType: !376, size: 8, align: 8, offset: 576)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "HasDIT", baseType: !376, size: 8, align: 8, offset: 584)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "IsNeoverse", baseType: !376, size: 8, align: 8, offset: 592)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_", baseType: !533, size: 512, align: 8, offset: 600)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "internal/cpu.Loong64", linkageName: "internal/cpu.Loong64", scope: !527, file: !527, line: 93, type: !602, isLocal: false, isDefinition: true, align: 8)
!602 = !DICompositeType(tag: DW_TAG_structure_type, size: 1064, align: 8, elements: !603)
!603 = !{!532, !604, !605, !606, !607, !608, !609}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "HasLSX", baseType: !376, size: 8, align: 8, offset: 512)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "HasLASX", baseType: !376, size: 8, align: 8, offset: 520)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "HasCRC32", baseType: !376, size: 8, align: 8, offset: 528)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "HasLAMCAS", baseType: !376, size: 8, align: 8, offset: 536)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "HasLAM_BH", baseType: !376, size: 8, align: 8, offset: 544)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_", baseType: !533, size: 512, align: 8, offset: 552)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(name: "internal/cpu.MIPS64X", linkageName: "internal/cpu.MIPS64X", scope: !527, file: !527, line: 103, type: !612, isLocal: false, isDefinition: true, align: 8)
!612 = !DICompositeType(tag: DW_TAG_structure_type, size: 1032, align: 8, elements: !613)
!613 = !{!532, !614, !615}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "HasMSA", baseType: !376, size: 8, align: 8, offset: 512)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_", baseType: !533, size: 512, align: 8, offset: 520)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(name: "internal/cpu.PPC64", linkageName: "internal/cpu.PPC64", scope: !527, file: !527, line: 114, type: !618, isLocal: false, isDefinition: true, align: 8)
!618 = !DICompositeType(tag: DW_TAG_structure_type, size: 1064, align: 8, elements: !619)
!619 = !{!532, !620, !621, !622, !623, !624, !609}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "HasDARN", baseType: !376, size: 8, align: 8, offset: 512)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "HasSCV", baseType: !376, size: 8, align: 8, offset: 520)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "IsPOWER8", baseType: !376, size: 8, align: 8, offset: 528)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "IsPOWER9", baseType: !376, size: 8, align: 8, offset: 536)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "IsPOWER10", baseType: !376, size: 8, align: 8, offset: 544)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(name: "internal/cpu.S390X", linkageName: "internal/cpu.S390X", scope: !527, file: !527, line: 124, type: !627, isLocal: false, isDefinition: true, align: 8)
!627 = !DICompositeType(tag: DW_TAG_structure_type, size: 1192, align: 8, elements: !628)
!628 = !{!532, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "HasZARCH", baseType: !376, size: 8, align: 8, offset: 512)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "HasSTFLE", baseType: !376, size: 8, align: 8, offset: 520)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "HasLDISP", baseType: !376, size: 8, align: 8, offset: 528)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "HasEIMM", baseType: !376, size: 8, align: 8, offset: 536)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "HasDFP", baseType: !376, size: 8, align: 8, offset: 544)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "HasETF3EH", baseType: !376, size: 8, align: 8, offset: 552)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "HasMSA", baseType: !376, size: 8, align: 8, offset: 560)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "HasAES", baseType: !376, size: 8, align: 8, offset: 568)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "HasAESCBC", baseType: !376, size: 8, align: 8, offset: 576)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "HasAESCTR", baseType: !376, size: 8, align: 8, offset: 584)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "HasAESGCM", baseType: !376, size: 8, align: 8, offset: 592)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "HasGHASH", baseType: !376, size: 8, align: 8, offset: 600)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "HasSHA1", baseType: !376, size: 8, align: 8, offset: 608)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "HasSHA256", baseType: !376, size: 8, align: 8, offset: 616)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "HasSHA512", baseType: !376, size: 8, align: 8, offset: 624)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "HasSHA3", baseType: !376, size: 8, align: 8, offset: 632)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "HasVX", baseType: !376, size: 8, align: 8, offset: 640)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "HasVXE", baseType: !376, size: 8, align: 8, offset: 648)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "HasKDSA", baseType: !376, size: 8, align: 8, offset: 656)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "HasECDSA", baseType: !376, size: 8, align: 8, offset: 664)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "HasEDDSA", baseType: !376, size: 8, align: 8, offset: 672)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_", baseType: !533, size: 512, align: 8, offset: 680)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(name: "internal/cpu.RISCV64", linkageName: "internal/cpu.RISCV64", scope: !527, file: !527, line: 154, type: !653, isLocal: false, isDefinition: true, align: 8)
!653 = !DICompositeType(tag: DW_TAG_structure_type, size: 1048, align: 8, elements: !654)
!654 = !{!532, !655, !656, !657, !584}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "HasFastMisaligned", baseType: !376, size: 8, align: 8, offset: 512)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "HasV", baseType: !376, size: 8, align: 8, offset: 520)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "HasZbb", baseType: !376, size: 8, align: 8, offset: 528)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(name: "internal/cpu.doDerived", linkageName: "internal/cpu.doDerived", scope: !527, file: !527, line: 174, type: !660, isLocal: false, isDefinition: true, align: 64)
!660 = !DICompositeType(tag: DW_TAG_structure_type, size: 128, align: 64, elements: !661)
!661 = !{!662, !663}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "context", baseType: !92, size: 64, align: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "fn", baseType: !92, size: 64, align: 64, offset: 64)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(name: "internal/cpu.options", linkageName: "internal/cpu.options", scope: !527, file: !527, line: 192, type: !666, isLocal: false, isDefinition: true, align: 64)
!666 = !DICompositeType(tag: DW_TAG_structure_type, name: "[]internal/cpu.option", size: 192, align: 64, elements: !667)
!667 = !{!668, !50, !678}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", baseType: !669, size: 64, align: 64)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64, align: 64, dwarfAddressSpace: 0)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "internal/cpu.option", baseType: !671)
!671 = !DICompositeType(tag: DW_TAG_structure_type, size: 256, align: 64, elements: !672)
!672 = !{!673, !674, !676, !677}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "Name", baseType: !46, size: 128, align: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "Feature", baseType: !675, size: 64, align: 64, offset: 128)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64, align: 64, dwarfAddressSpace: 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "Specified", baseType: !376, size: 8, align: 8, offset: 192)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "Enable", baseType: !376, size: 8, align: 8, offset: 200)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "cap", baseType: !51, size: 64, align: 64, offset: 128)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(scope: null, file: !527, line: 218, type: !36, isLocal: true, isDefinition: true)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(scope: null, file: !527, line: 223, type: !308, isLocal: true, isDefinition: true)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(scope: null, file: !527, line: 223, type: !135, isLocal: true, isDefinition: true)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(scope: null, file: !527, line: 230, type: !135, isLocal: true, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(scope: null, file: !527, line: 239, type: !54, isLocal: true, isDefinition: true)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(scope: null, file: !527, line: 255, type: !313, isLocal: true, isDefinition: true)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(scope: null, file: !527, line: 255, type: !135, isLocal: true, isDefinition: true)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(scope: null, file: !527, line: 232, type: !54, isLocal: true, isDefinition: true)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(scope: null, file: !527, line: 235, type: !318, isLocal: true, isDefinition: true)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(scope: null, file: !527, line: 235, type: !699, isLocal: true, isDefinition: true)
!699 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, align: 8, elements: !700)
!700 = !{!701}
!701 = !DISubrange(count: 32, lowerBound: 0)
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(scope: null, file: !527, line: 235, type: !135, isLocal: true, isDefinition: true)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(scope: null, file: !527, line: 264, type: !706, isLocal: true, isDefinition: true)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, align: 8, elements: !707)
!707 = !{!708}
!708 = !DISubrange(count: 25, lowerBound: 0)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(scope: null, file: !527, line: 264, type: !446, isLocal: true, isDefinition: true)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "internal/cpu.maxExtendedFunctionInformation", linkageName: "internal/cpu.maxExtendedFunctionInformation", scope: !713, file: !713, line: 69, type: !106, isLocal: false, isDefinition: true, align: 32)
!713 = !DIFile(filename: "cpu_x86.go", directory: "/usr/local/go/src/internal/cpu")
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(scope: null, file: !713, line: 73, type: !54, isLocal: true, isDefinition: true)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(scope: null, file: !713, line: 74, type: !54, isLocal: true, isDefinition: true)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(scope: null, file: !713, line: 75, type: !36, isLocal: true, isDefinition: true)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(scope: null, file: !713, line: 76, type: !36, isLocal: true, isDefinition: true)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(scope: null, file: !713, line: 77, type: !223, isLocal: true, isDefinition: true)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(scope: null, file: !713, line: 78, type: !208, isLocal: true, isDefinition: true)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(scope: null, file: !713, line: 79, type: !54, isLocal: true, isDefinition: true)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(scope: null, file: !713, line: 80, type: !228, isLocal: true, isDefinition: true)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(scope: null, file: !713, line: 87, type: !208, isLocal: true, isDefinition: true)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(scope: null, file: !713, line: 88, type: !36, isLocal: true, isDefinition: true)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(scope: null, file: !713, line: 89, type: !61, isLocal: true, isDefinition: true)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(scope: null, file: !713, line: 90, type: !61, isLocal: true, isDefinition: true)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(scope: null, file: !713, line: 91, type: !61, isLocal: true, isDefinition: true)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(scope: null, file: !713, line: 97, type: !54, isLocal: true, isDefinition: true)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(scope: null, file: !713, line: 98, type: !36, isLocal: true, isDefinition: true)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(scope: null, file: !713, line: 99, type: !36, isLocal: true, isDefinition: true)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(scope: null, file: !713, line: 100, type: !36, isLocal: true, isDefinition: true)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(scope: null, file: !713, line: 101, type: !54, isLocal: true, isDefinition: true)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(scope: null, file: !713, line: 107, type: !79, isLocal: true, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(scope: null, file: !713, line: 108, type: !72, isLocal: true, isDefinition: true)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(scope: null, file: !713, line: 109, type: !72, isLocal: true, isDefinition: true)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(scope: null, file: !713, line: 110, type: !72, isLocal: true, isDefinition: true)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(scope: null, file: !713, line: 111, type: !72, isLocal: true, isDefinition: true)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(scope: null, file: !762, line: 1, type: !763, isLocal: true, isDefinition: true)
!762 = !DIFile(filename: "datacache_x86.go", directory: "/usr/local/go/src/internal/cpu")
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, align: 8, elements: !764)
!764 = !{!765}
!765 = !DISubrange(count: 13, lowerBound: 0)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(scope: null, file: !762, line: 1, type: !768, isLocal: true, isDefinition: true)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 664, align: 8, elements: !769)
!769 = !{!770}
!770 = !DISubrange(count: 83, lowerBound: 0)
!771 = distinct !DICompileUnit(language: DW_LANG_C99, file: !522, producer: "TinyGo", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !772)
!772 = !{!773, !777, !779, !787}
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(name: "math/bits.deBruijn32tab", linkageName: "math/bits.deBruijn32tab", scope: !775, file: !775, line: 44, type: !776, isLocal: false, isDefinition: true, align: 8)
!775 = !DIFile(filename: "bits.go", directory: "/usr/local/go/src/math/bits")
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !538, size: 256, align: 8, elements: !700)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(name: "math/bits.deBruijn64tab", linkageName: "math/bits.deBruijn64tab", scope: !775, file: !775, line: 51, type: !537, isLocal: false, isDefinition: true, align: 8)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(name: "math/bits.overflowError", linkageName: "runtime.overflowError", scope: !781, file: !781, line: 12, type: !782, isLocal: false, isDefinition: true, align: 64)
!781 = !DIFile(filename: "bits_errors.go", directory: "/usr/local/go/src/math/bits")
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "error", baseType: !783)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "runtime._interface", baseType: !784)
!784 = !DICompositeType(tag: DW_TAG_structure_type, size: 128, align: 64, elements: !785)
!785 = !{!113, !786}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "value", baseType: !92, size: 64, align: 64, offset: 64)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(name: "math/bits.divideError", linkageName: "runtime.divideError", scope: !781, file: !781, line: 15, type: !782, isLocal: false, isDefinition: true, align: 64)
!789 = distinct !DICompileUnit(language: DW_LANG_C99, file: !522, producer: "TinyGo", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !790)
!790 = !{!791, !793, !796, !801, !804, !807, !811, !813, !815, !817, !819, !821, !823, !825, !827, !829, !831, !833, !835, !837, !839, !841, !844, !846, !848, !850, !852, !854, !856, !858, !860, !862, !864, !866, !868, !870, !872, !874, !878, !880, !882, !885, !887, !889, !891, !895, !898, !903, !906, !908, !912, !914, !917, !919, !923, !926, !928, !930, !932, !934, !936, !938, !940, !942, !944, !946, !948, !950, !952, !954, !0, !956, !958, !7, !960, !962, !964, !966, !968, !970, !972, !974}
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(name: "internal/cpu.X86", linkageName: "internal/cpu.X86", scope: !527, file: !527, line: 23, type: !530, isLocal: false, isDefinition: true, align: 8)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(name: "math.useFMA", linkageName: "math.useFMA", scope: !795, file: !795, line: 11, type: !376, isLocal: false, isDefinition: true, align: 8)
!795 = !DIFile(filename: "exp_amd64.go", directory: "/usr/local/go/src/math")
!796 = !DIGlobalVariableExpression(var: !797, expr: !DIExpression())
!797 = distinct !DIGlobalVariable(name: "math._gamP", linkageName: "math._gamP", scope: !798, file: !798, line: 66, type: !799, isLocal: false, isDefinition: true, align: 64)
!798 = !DIFile(filename: "gamma.go", directory: "/usr/local/go/src/math")
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !800, size: 448, align: 64, elements: !80)
!800 = !DIBasicType(name: "float64", size: 64, encoding: DW_ATE_float)
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(name: "math._gamQ", linkageName: "math._gamQ", scope: !798, file: !798, line: 75, type: !803, isLocal: false, isDefinition: true, align: 64)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !800, size: 512, align: 64, elements: !73)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(name: "math._gamS", linkageName: "math._gamS", scope: !798, file: !798, line: 85, type: !806, isLocal: false, isDefinition: true, align: 64)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !800, size: 320, align: 64, elements: !62)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(name: "math.p0R8", linkageName: "math.p0R8", scope: !809, file: !809, line: 240, type: !810, isLocal: false, isDefinition: true, align: 64)
!809 = !DIFile(filename: "j0.go", directory: "/usr/local/go/src/math")
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !800, size: 384, align: 64, elements: !209)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(name: "math.p0S8", linkageName: "math.p0S8", scope: !809, file: !809, line: 248, type: !806, isLocal: false, isDefinition: true, align: 64)
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(name: "math.p0R5", linkageName: "math.p0R5", scope: !809, file: !809, line: 257, type: !810, isLocal: false, isDefinition: true, align: 64)
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(name: "math.p0S5", linkageName: "math.p0S5", scope: !809, file: !809, line: 265, type: !806, isLocal: false, isDefinition: true, align: 64)
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(name: "math.p0R3", linkageName: "math.p0R3", scope: !809, file: !809, line: 274, type: !810, isLocal: false, isDefinition: true, align: 64)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(name: "math.p0S3", linkageName: "math.p0S3", scope: !809, file: !809, line: 282, type: !806, isLocal: false, isDefinition: true, align: 64)
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(name: "math.p0R2", linkageName: "math.p0R2", scope: !809, file: !809, line: 291, type: !810, isLocal: false, isDefinition: true, align: 64)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(name: "math.p0S2", linkageName: "math.p0S2", scope: !809, file: !809, line: 299, type: !806, isLocal: false, isDefinition: true, align: 64)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(name: "math.q0R8", linkageName: "math.q0R8", scope: !809, file: !809, line: 339, type: !810, isLocal: false, isDefinition: true, align: 64)
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(name: "math.q0S8", linkageName: "math.q0S8", scope: !809, file: !809, line: 347, type: !810, isLocal: false, isDefinition: true, align: 64)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(name: "math.q0R5", linkageName: "math.q0R5", scope: !809, file: !809, line: 357, type: !810, isLocal: false, isDefinition: true, align: 64)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(name: "math.q0S5", linkageName: "math.q0S5", scope: !809, file: !809, line: 365, type: !810, isLocal: false, isDefinition: true, align: 64)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(name: "math.q0R3", linkageName: "math.q0R3", scope: !809, file: !809, line: 375, type: !810, isLocal: false, isDefinition: true, align: 64)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(name: "math.q0S3", linkageName: "math.q0S3", scope: !809, file: !809, line: 383, type: !810, isLocal: false, isDefinition: true, align: 64)
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(name: "math.q0R2", linkageName: "math.q0R2", scope: !809, file: !809, line: 393, type: !810, isLocal: false, isDefinition: true, align: 64)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(name: "math.q0S2", linkageName: "math.q0S2", scope: !809, file: !809, line: 401, type: !810, isLocal: false, isDefinition: true, align: 64)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(name: "math.p1R8", linkageName: "math.p1R8", scope: !843, file: !843, line: 235, type: !810, isLocal: false, isDefinition: true, align: 64)
!843 = !DIFile(filename: "j1.go", directory: "/usr/local/go/src/math")
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(name: "math.p1S8", linkageName: "math.p1S8", scope: !843, file: !843, line: 243, type: !806, isLocal: false, isDefinition: true, align: 64)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(name: "math.p1R5", linkageName: "math.p1R5", scope: !843, file: !843, line: 252, type: !810, isLocal: false, isDefinition: true, align: 64)
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(name: "math.p1S5", linkageName: "math.p1S5", scope: !843, file: !843, line: 260, type: !806, isLocal: false, isDefinition: true, align: 64)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(name: "math.p1R3", linkageName: "math.p1R3", scope: !843, file: !843, line: 269, type: !810, isLocal: false, isDefinition: true, align: 64)
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(name: "math.p1S3", linkageName: "math.p1S3", scope: !843, file: !843, line: 277, type: !806, isLocal: false, isDefinition: true, align: 64)
!854 = !DIGlobalVariableExpression(var: !855, expr: !DIExpression())
!855 = distinct !DIGlobalVariable(name: "math.p1R2", linkageName: "math.p1R2", scope: !843, file: !843, line: 286, type: !810, isLocal: false, isDefinition: true, align: 64)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(name: "math.p1S2", linkageName: "math.p1S2", scope: !843, file: !843, line: 294, type: !806, isLocal: false, isDefinition: true, align: 64)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(name: "math.q1R8", linkageName: "math.q1R8", scope: !843, file: !843, line: 334, type: !810, isLocal: false, isDefinition: true, align: 64)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(name: "math.q1S8", linkageName: "math.q1S8", scope: !843, file: !843, line: 342, type: !810, isLocal: false, isDefinition: true, align: 64)
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(name: "math.q1R5", linkageName: "math.q1R5", scope: !843, file: !843, line: 352, type: !810, isLocal: false, isDefinition: true, align: 64)
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(name: "math.q1S5", linkageName: "math.q1S5", scope: !843, file: !843, line: 360, type: !810, isLocal: false, isDefinition: true, align: 64)
!866 = !DIGlobalVariableExpression(var: !867, expr: !DIExpression())
!867 = distinct !DIGlobalVariable(name: "math.q1R3", linkageName: "math.q1R3", scope: !843, file: !843, line: 370, type: !810, isLocal: false, isDefinition: true, align: 64)
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(name: "math.q1S3", linkageName: "math.q1S3", scope: !843, file: !843, line: 378, type: !810, isLocal: false, isDefinition: true, align: 64)
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(name: "math.q1R2", linkageName: "math.q1R2", scope: !843, file: !843, line: 388, type: !810, isLocal: false, isDefinition: true, align: 64)
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(name: "math.q1S2", linkageName: "math.q1S2", scope: !843, file: !843, line: 396, type: !810, isLocal: false, isDefinition: true, align: 64)
!874 = !DIGlobalVariableExpression(var: !875, expr: !DIExpression())
!875 = distinct !DIGlobalVariable(name: "math._lgamA", linkageName: "math._lgamA", scope: !876, file: !876, line: 91, type: !877, isLocal: false, isDefinition: true, align: 64)
!876 = !DIFile(filename: "lgamma.go", directory: "/usr/local/go/src/math")
!877 = !DICompositeType(tag: DW_TAG_array_type, baseType: !800, size: 768, align: 64, elements: !302)
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(name: "math._lgamR", linkageName: "math._lgamR", scope: !876, file: !876, line: 105, type: !799, isLocal: false, isDefinition: true, align: 64)
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(name: "math._lgamS", linkageName: "math._lgamS", scope: !876, file: !876, line: 114, type: !799, isLocal: false, isDefinition: true, align: 64)
!882 = !DIGlobalVariableExpression(var: !883, expr: !DIExpression())
!883 = distinct !DIGlobalVariable(name: "math._lgamT", linkageName: "math._lgamT", scope: !876, file: !876, line: 123, type: !884, isLocal: false, isDefinition: true, align: 64)
!884 = !DICompositeType(tag: DW_TAG_array_type, baseType: !800, size: 960, align: 64, elements: !5)
!885 = !DIGlobalVariableExpression(var: !886, expr: !DIExpression())
!886 = distinct !DIGlobalVariable(name: "math._lgamU", linkageName: "math._lgamU", scope: !876, file: !876, line: 140, type: !810, isLocal: false, isDefinition: true, align: 64)
!887 = !DIGlobalVariableExpression(var: !888, expr: !DIExpression())
!888 = distinct !DIGlobalVariable(name: "math._lgamV", linkageName: "math._lgamV", scope: !876, file: !876, line: 148, type: !810, isLocal: false, isDefinition: true, align: 64)
!889 = !DIGlobalVariableExpression(var: !890, expr: !DIExpression())
!890 = distinct !DIGlobalVariable(name: "math._lgamW", linkageName: "math._lgamW", scope: !876, file: !876, line: 156, type: !799, isLocal: false, isDefinition: true, align: 64)
!891 = !DIGlobalVariableExpression(var: !892, expr: !DIExpression())
!892 = distinct !DIGlobalVariable(name: "math.pow10tab", linkageName: "math.pow10tab", scope: !893, file: !893, line: 8, type: !894, isLocal: false, isDefinition: true, align: 64)
!893 = !DIFile(filename: "pow10.go", directory: "/usr/local/go/src/math")
!894 = !DICompositeType(tag: DW_TAG_array_type, baseType: !800, size: 2048, align: 64, elements: !700)
!895 = !DIGlobalVariableExpression(var: !896, expr: !DIExpression())
!896 = distinct !DIGlobalVariable(name: "math.pow10postab32", linkageName: "math.pow10postab32", scope: !893, file: !893, line: 16, type: !897, isLocal: false, isDefinition: true, align: 64)
!897 = !DICompositeType(tag: DW_TAG_array_type, baseType: !800, size: 640, align: 64, elements: !229)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(name: "math.pow10negtab32", linkageName: "math.pow10negtab32", scope: !893, file: !893, line: 21, type: !900, isLocal: false, isDefinition: true, align: 64)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !800, size: 704, align: 64, elements: !901)
!901 = !{!902}
!902 = !DISubrange(count: 11, lowerBound: 0)
!903 = !DIGlobalVariableExpression(var: !904, expr: !DIExpression())
!904 = distinct !DIGlobalVariable(name: "math._sin", linkageName: "math._sin", scope: !905, file: !905, line: 93, type: !810, isLocal: false, isDefinition: true, align: 64)
!905 = !DIFile(filename: "sin.go", directory: "/usr/local/go/src/math")
!906 = !DIGlobalVariableExpression(var: !907, expr: !DIExpression())
!907 = distinct !DIGlobalVariable(name: "math._cos", linkageName: "math._cos", scope: !905, file: !905, line: 103, type: !810, isLocal: false, isDefinition: true, align: 64)
!908 = !DIGlobalVariableExpression(var: !909, expr: !DIExpression())
!909 = distinct !DIGlobalVariable(name: "math._tanP", linkageName: "math._tanP", scope: !910, file: !910, line: 63, type: !911, isLocal: false, isDefinition: true, align: 64)
!910 = !DIFile(filename: "tan.go", directory: "/usr/local/go/src/math")
!911 = !DICompositeType(tag: DW_TAG_array_type, baseType: !800, size: 192, align: 64, elements: !55)
!912 = !DIGlobalVariableExpression(var: !913, expr: !DIExpression())
!913 = distinct !DIGlobalVariable(name: "math._tanQ", linkageName: "math._tanQ", scope: !910, file: !910, line: 68, type: !806, isLocal: false, isDefinition: true, align: 64)
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(name: "math.tanhP", linkageName: "math.tanhP", scope: !916, file: !916, line: 57, type: !911, isLocal: false, isDefinition: true, align: 64)
!916 = !DIFile(filename: "tanh.go", directory: "/usr/local/go/src/math")
!917 = !DIGlobalVariableExpression(var: !918, expr: !DIExpression())
!918 = distinct !DIGlobalVariable(name: "math.tanhQ", linkageName: "math.tanhQ", scope: !916, file: !916, line: 62, type: !911, isLocal: false, isDefinition: true, align: 64)
!919 = !DIGlobalVariableExpression(var: !920, expr: !DIExpression())
!920 = distinct !DIGlobalVariable(name: "math.mPi4", linkageName: "math.mPi4", scope: !921, file: !921, line: 81, type: !922, isLocal: false, isDefinition: true, align: 64)
!921 = !DIFile(filename: "trig_reduce.go", directory: "/usr/local/go/src/math")
!922 = !DICompositeType(tag: DW_TAG_array_type, baseType: !343, size: 1280, align: 64, elements: !394)
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(scope: null, file: !925, line: 1, type: !3, isLocal: true, isDefinition: true)
!925 = !DIFile(filename: "exp2_noasm.go", directory: "/usr/local/go/src/math")
!926 = !DIGlobalVariableExpression(var: !927, expr: !DIExpression())
!927 = distinct !DIGlobalVariable(name: "type *string", scope: !86, file: !86, line: 1, type: !95, isLocal: false, isDefinition: true, align: 64)
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(name: "type string", scope: !86, file: !86, line: 1, type: !87, isLocal: false, isDefinition: true, align: 64)
!930 = !DIGlobalVariableExpression(var: !931, expr: !DIExpression())
!931 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression())
!933 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!936 = !DIGlobalVariableExpression(var: !937, expr: !DIExpression())
!937 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!940 = !DIGlobalVariableExpression(var: !941, expr: !DIExpression())
!941 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!950 = !DIGlobalVariableExpression(var: !951, expr: !DIExpression())
!951 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!952 = !DIGlobalVariableExpression(var: !953, expr: !DIExpression())
!953 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!954 = !DIGlobalVariableExpression(var: !955, expr: !DIExpression())
!955 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!956 = !DIGlobalVariableExpression(var: !957, expr: !DIExpression())
!957 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!960 = !DIGlobalVariableExpression(var: !961, expr: !DIExpression())
!961 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!964 = !DIGlobalVariableExpression(var: !965, expr: !DIExpression())
!965 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!968 = !DIGlobalVariableExpression(var: !969, expr: !DIExpression())
!969 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!970 = !DIGlobalVariableExpression(var: !971, expr: !DIExpression())
!971 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1, type: !3, isLocal: true, isDefinition: true)
!976 = distinct !DICompileUnit(language: DW_LANG_C99, file: !522, producer: "TinyGo", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !977)
!977 = !{!978, !984, !986, !988, !993, !995, !1000, !1005, !1010, !1015}
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(scope: null, file: !980, line: 1, type: !981, isLocal: true, isDefinition: true)
!980 = !DIFile(filename: "value.go", directory: "/usr/local/go/src/sync/atomic")
!981 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 424, align: 8, elements: !982)
!982 = !{!983}
!983 = !DISubrange(count: 53, lowerBound: 0)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(name: "type *string", scope: !86, file: !86, line: 1, type: !95, isLocal: false, isDefinition: true, align: 64)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(name: "type string", scope: !86, file: !86, line: 1, type: !87, isLocal: false, isDefinition: true, align: 64)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(scope: null, file: !980, line: 1, type: !990, isLocal: true, isDefinition: true)
!990 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, align: 8, elements: !991)
!991 = !{!992}
!992 = !DISubrange(count: 60, lowerBound: 0)
!993 = !DIGlobalVariableExpression(var: !994, expr: !DIExpression())
!994 = distinct !DIGlobalVariable(name: "sync/atomic.firstStoreInProgress", linkageName: "sync/atomic.firstStoreInProgress", scope: !980, file: !980, line: 42, type: !538, isLocal: false, isDefinition: true, align: 8)
!995 = !DIGlobalVariableExpression(var: !996, expr: !DIExpression())
!996 = distinct !DIGlobalVariable(scope: null, file: !980, line: 1, type: !997, isLocal: true, isDefinition: true)
!997 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 560, align: 8, elements: !998)
!998 = !{!999}
!999 = !DISubrange(count: 70, lowerBound: 0)
!1000 = !DIGlobalVariableExpression(var: !1001, expr: !DIExpression())
!1001 = distinct !DIGlobalVariable(scope: null, file: !980, line: 1, type: !1002, isLocal: true, isDefinition: true)
!1002 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, align: 8, elements: !1003)
!1003 = !{!1004}
!1004 = !DISubrange(count: 42, lowerBound: 0)
!1005 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression())
!1006 = distinct !DIGlobalVariable(scope: null, file: !980, line: 1, type: !1007, isLocal: true, isDefinition: true)
!1007 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 472, align: 8, elements: !1008)
!1008 = !{!1009}
!1009 = !DISubrange(count: 59, lowerBound: 0)
!1010 = !DIGlobalVariableExpression(var: !1011, expr: !DIExpression())
!1011 = distinct !DIGlobalVariable(scope: null, file: !980, line: 1, type: !1012, isLocal: true, isDefinition: true)
!1012 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, align: 8, elements: !1013)
!1013 = !{!1014}
!1014 = !DISubrange(count: 41, lowerBound: 0)
!1015 = !DIGlobalVariableExpression(var: !1016, expr: !DIExpression())
!1016 = distinct !DIGlobalVariable(scope: null, file: !980, line: 1, type: !1017, isLocal: true, isDefinition: true)
!1017 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 464, align: 8, elements: !1018)
!1018 = !{!1019}
!1019 = !DISubrange(count: 58, lowerBound: 0)
!1020 = distinct !DICompileUnit(language: DW_LANG_C99, file: !522, producer: "TinyGo", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!1021 = distinct !DICompileUnit(language: DW_LANG_C99, file: !522, producer: "TinyGo", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!1022 = distinct !DICompileUnit(language: DW_LANG_C99, file: !522, producer: "TinyGo", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1023)
